Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x9f4 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xd9556): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xa92fd): ../Core/Src/Fusion/Fusion.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x46da3): C:/Users/dkalaitzakis/STM32CubeIDE/workspace_1.12.1/stm32_devboard_RTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x841bd): signed char
 <1><30>: Abbrev Number: 2 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 1
    <32>   DW_AT_encoding    : 8	(unsigned char)
    <33>   DW_AT_name        : (indirect string, offset: 0xfe0c4): unsigned char
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 2
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0xc40ba): short int
 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 2
    <40>   DW_AT_encoding    : 7	(unsigned)
    <41>   DW_AT_name        : (indirect string, offset: 0xfc3da): short unsigned int
 <1><45>: Abbrev Number: 2 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 4
    <47>   DW_AT_encoding    : 5	(signed)
    <48>   DW_AT_name        : (indirect string, offset: 0x164dd): long int
 <1><4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 4
    <4e>   DW_AT_encoding    : 7	(unsigned)
    <4f>   DW_AT_name        : (indirect string, offset: 0x63f03): long unsigned int
 <1><53>: Abbrev Number: 2 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 8
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0x77ec6): long long int
 <1><5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 8
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x36426): long long unsigned int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : int
 <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
    <69>   DW_AT_byte_size   : 4
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_name        : (indirect string, offset: 0x15906): unsigned int
 <1><6f>: Abbrev Number: 4 (DW_TAG_const_type)
    <70>   DW_AT_type        : <0x68>
 <1><74>: Abbrev Number: 2 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 8
    <76>   DW_AT_encoding    : 4	(float)
    <77>   DW_AT_name        : (indirect string, offset: 0x182bb): long double
 <1><7b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <7c>   DW_AT_byte_size   : 40
    <7d>   DW_AT_decl_file   : 4
    <7e>   DW_AT_decl_line   : 63
    <7f>   DW_AT_decl_column : 9
    <80>   DW_AT_sibling     : <0x107>
 <2><84>: Abbrev Number: 6 (DW_TAG_member)
    <85>   DW_AT_name        : (indirect string, offset: 0x15ab5): gyro_x
    <89>   DW_AT_decl_file   : 4
    <8a>   DW_AT_decl_line   : 64
    <8b>   DW_AT_decl_column : 11
    <8c>   DW_AT_type        : <0x107>
    <90>   DW_AT_data_member_location: 0
 <2><91>: Abbrev Number: 6 (DW_TAG_member)
    <92>   DW_AT_name        : (indirect string, offset: 0x15abc): gyro_y
    <96>   DW_AT_decl_file   : 4
    <97>   DW_AT_decl_line   : 65
    <98>   DW_AT_decl_column : 11
    <99>   DW_AT_type        : <0x107>
    <9d>   DW_AT_data_member_location: 4
 <2><9e>: Abbrev Number: 6 (DW_TAG_member)
    <9f>   DW_AT_name        : (indirect string, offset: 0x15ac3): gyro_z
    <a3>   DW_AT_decl_file   : 4
    <a4>   DW_AT_decl_line   : 66
    <a5>   DW_AT_decl_column : 11
    <a6>   DW_AT_type        : <0x107>
    <aa>   DW_AT_data_member_location: 8
 <2><ab>: Abbrev Number: 6 (DW_TAG_member)
    <ac>   DW_AT_name        : (indirect string, offset: 0x66684): acc_x
    <b0>   DW_AT_decl_file   : 4
    <b1>   DW_AT_decl_line   : 67
    <b2>   DW_AT_decl_column : 11
    <b3>   DW_AT_type        : <0x107>
    <b7>   DW_AT_data_member_location: 12
 <2><b8>: Abbrev Number: 6 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0x2ff37): acc_y
    <bd>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 68
    <bf>   DW_AT_decl_column : 11
    <c0>   DW_AT_type        : <0x107>
    <c4>   DW_AT_data_member_location: 16
 <2><c5>: Abbrev Number: 6 (DW_TAG_member)
    <c6>   DW_AT_name        : (indirect string, offset: 0x2ff66): acc_z
    <ca>   DW_AT_decl_file   : 4
    <cb>   DW_AT_decl_line   : 69
    <cc>   DW_AT_decl_column : 11
    <cd>   DW_AT_type        : <0x107>
    <d1>   DW_AT_data_member_location: 20
 <2><d2>: Abbrev Number: 6 (DW_TAG_member)
    <d3>   DW_AT_name        : (indirect string, offset: 0x13cee): magn_x
    <d7>   DW_AT_decl_file   : 4
    <d8>   DW_AT_decl_line   : 70
    <d9>   DW_AT_decl_column : 11
    <da>   DW_AT_type        : <0x107>
    <de>   DW_AT_data_member_location: 24
 <2><df>: Abbrev Number: 6 (DW_TAG_member)
    <e0>   DW_AT_name        : (indirect string, offset: 0xe4b92): magn_y
    <e4>   DW_AT_decl_file   : 4
    <e5>   DW_AT_decl_line   : 71
    <e6>   DW_AT_decl_column : 11
    <e7>   DW_AT_type        : <0x107>
    <eb>   DW_AT_data_member_location: 28
 <2><ec>: Abbrev Number: 6 (DW_TAG_member)
    <ed>   DW_AT_name        : (indirect string, offset: 0xe4b99): magn_z
    <f1>   DW_AT_decl_file   : 4
    <f2>   DW_AT_decl_line   : 72
    <f3>   DW_AT_decl_column : 11
    <f4>   DW_AT_type        : <0x107>
    <f8>   DW_AT_data_member_location: 32
 <2><f9>: Abbrev Number: 6 (DW_TAG_member)
    <fa>   DW_AT_name        : (indirect string, offset: 0x8a9d8): timestamp
    <fe>   DW_AT_decl_file   : 4
    <ff>   DW_AT_decl_line   : 73
    <100>   DW_AT_decl_column : 9
    <101>   DW_AT_type        : <0x61>
    <105>   DW_AT_data_member_location: 36
 <2><106>: Abbrev Number: 0
 <1><107>: Abbrev Number: 2 (DW_TAG_base_type)
    <108>   DW_AT_byte_size   : 4
    <109>   DW_AT_encoding    : 4	(float)
    <10a>   DW_AT_name        : (indirect string, offset: 0x10b1ee): float
 <1><10e>: Abbrev Number: 4 (DW_TAG_const_type)
    <10f>   DW_AT_type        : <0x107>
 <1><113>: Abbrev Number: 7 (DW_TAG_typedef)
    <114>   DW_AT_name        : (indirect string, offset: 0x7ea38): mems_data_t
    <118>   DW_AT_decl_file   : 4
    <119>   DW_AT_decl_line   : 74
    <11a>   DW_AT_decl_column : 2
    <11b>   DW_AT_type        : <0x7b>
 <1><11f>: Abbrev Number: 8 (DW_TAG_enumeration_type)
    <120>   DW_AT_encoding    : 7	(unsigned)
    <121>   DW_AT_byte_size   : 1
    <122>   DW_AT_type        : <0x30>
    <126>   DW_AT_decl_file   : 5
    <127>   DW_AT_decl_line   : 16
    <128>   DW_AT_decl_column : 14
    <129>   DW_AT_sibling     : <0x140>
 <2><12d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <12e>   DW_AT_name        : (indirect string, offset: 0x105aae): FusionConventionNwu
    <132>   DW_AT_const_value : 0
 <2><133>: Abbrev Number: 9 (DW_TAG_enumerator)
    <134>   DW_AT_name        : (indirect string, offset: 0xdd0c6): FusionConventionEnu
    <138>   DW_AT_const_value : 1
 <2><139>: Abbrev Number: 9 (DW_TAG_enumerator)
    <13a>   DW_AT_name        : (indirect string, offset: 0xfbd21): FusionConventionNed
    <13e>   DW_AT_const_value : 2
 <2><13f>: Abbrev Number: 0
 <1><140>: Abbrev Number: 7 (DW_TAG_typedef)
    <141>   DW_AT_name        : (indirect string, offset: 0xa9da9): FusionConvention
    <145>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 20
    <147>   DW_AT_decl_column : 3
    <148>   DW_AT_type        : <0x11f>
 <1><14c>: Abbrev Number: 2 (DW_TAG_base_type)
    <14d>   DW_AT_byte_size   : 1
    <14e>   DW_AT_encoding    : 8	(unsigned char)
    <14f>   DW_AT_name        : (indirect string, offset: 0x10db0a): char
 <1><153>: Abbrev Number: 2 (DW_TAG_base_type)
    <154>   DW_AT_byte_size   : 8
    <155>   DW_AT_encoding    : 4	(float)
    <156>   DW_AT_name        : (indirect string, offset: 0x10d117): double
 <1><15a>: Abbrev Number: 5 (DW_TAG_structure_type)
    <15b>   DW_AT_byte_size   : 12
    <15c>   DW_AT_decl_file   : 1
    <15d>   DW_AT_decl_line   : 26
    <15e>   DW_AT_decl_column : 5
    <15f>   DW_AT_sibling     : <0x185>
 <2><163>: Abbrev Number: 10 (DW_TAG_member)
    <164>   DW_AT_name        : x
    <166>   DW_AT_decl_file   : 1
    <167>   DW_AT_decl_line   : 27
    <168>   DW_AT_decl_column : 15
    <169>   DW_AT_type        : <0x107>
    <16d>   DW_AT_data_member_location: 0
 <2><16e>: Abbrev Number: 10 (DW_TAG_member)
    <16f>   DW_AT_name        : y
    <171>   DW_AT_decl_file   : 1
    <172>   DW_AT_decl_line   : 28
    <173>   DW_AT_decl_column : 15
    <174>   DW_AT_type        : <0x107>
    <178>   DW_AT_data_member_location: 4
 <2><179>: Abbrev Number: 10 (DW_TAG_member)
    <17a>   DW_AT_name        : z
    <17c>   DW_AT_decl_file   : 1
    <17d>   DW_AT_decl_line   : 29
    <17e>   DW_AT_decl_column : 15
    <17f>   DW_AT_type        : <0x107>
    <183>   DW_AT_data_member_location: 8
 <2><184>: Abbrev Number: 0
 <1><185>: Abbrev Number: 11 (DW_TAG_union_type)
    <186>   DW_AT_byte_size   : 12
    <187>   DW_AT_decl_file   : 1
    <188>   DW_AT_decl_line   : 23
    <189>   DW_AT_decl_column : 9
    <18a>   DW_AT_sibling     : <0x1a7>
 <2><18e>: Abbrev Number: 12 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0x116fb9): array
    <193>   DW_AT_decl_file   : 1
    <194>   DW_AT_decl_line   : 24
    <195>   DW_AT_decl_column : 11
    <196>   DW_AT_type        : <0x1a7>
 <2><19a>: Abbrev Number: 12 (DW_TAG_member)
    <19b>   DW_AT_name        : (indirect string, offset: 0xaac8a): axis
    <19f>   DW_AT_decl_file   : 1
    <1a0>   DW_AT_decl_line   : 30
    <1a1>   DW_AT_decl_column : 7
    <1a2>   DW_AT_type        : <0x15a>
 <2><1a6>: Abbrev Number: 0
 <1><1a7>: Abbrev Number: 13 (DW_TAG_array_type)
    <1a8>   DW_AT_type        : <0x107>
    <1ac>   DW_AT_sibling     : <0x1b7>
 <2><1b0>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <1b1>   DW_AT_type        : <0x68>
    <1b5>   DW_AT_upper_bound : 2
 <2><1b6>: Abbrev Number: 0
 <1><1b7>: Abbrev Number: 7 (DW_TAG_typedef)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x9add7): FusionVector
    <1bc>   DW_AT_decl_file   : 1
    <1bd>   DW_AT_decl_line   : 31
    <1be>   DW_AT_decl_column : 3
    <1bf>   DW_AT_type        : <0x185>
 <1><1c3>: Abbrev Number: 4 (DW_TAG_const_type)
    <1c4>   DW_AT_type        : <0x1b7>
 <1><1c8>: Abbrev Number: 5 (DW_TAG_structure_type)
    <1c9>   DW_AT_byte_size   : 16
    <1ca>   DW_AT_decl_file   : 1
    <1cb>   DW_AT_decl_line   : 39
    <1cc>   DW_AT_decl_column : 5
    <1cd>   DW_AT_sibling     : <0x1fe>
 <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
    <1d2>   DW_AT_name        : w
    <1d4>   DW_AT_decl_file   : 1
    <1d5>   DW_AT_decl_line   : 40
    <1d6>   DW_AT_decl_column : 15
    <1d7>   DW_AT_type        : <0x107>
    <1db>   DW_AT_data_member_location: 0
 <2><1dc>: Abbrev Number: 10 (DW_TAG_member)
    <1dd>   DW_AT_name        : x
    <1df>   DW_AT_decl_file   : 1
    <1e0>   DW_AT_decl_line   : 41
    <1e1>   DW_AT_decl_column : 15
    <1e2>   DW_AT_type        : <0x107>
    <1e6>   DW_AT_data_member_location: 4
 <2><1e7>: Abbrev Number: 10 (DW_TAG_member)
    <1e8>   DW_AT_name        : y
    <1ea>   DW_AT_decl_file   : 1
    <1eb>   DW_AT_decl_line   : 42
    <1ec>   DW_AT_decl_column : 15
    <1ed>   DW_AT_type        : <0x107>
    <1f1>   DW_AT_data_member_location: 8
 <2><1f2>: Abbrev Number: 10 (DW_TAG_member)
    <1f3>   DW_AT_name        : z
    <1f5>   DW_AT_decl_file   : 1
    <1f6>   DW_AT_decl_line   : 43
    <1f7>   DW_AT_decl_column : 15
    <1f8>   DW_AT_type        : <0x107>
    <1fc>   DW_AT_data_member_location: 12
 <2><1fd>: Abbrev Number: 0
 <1><1fe>: Abbrev Number: 11 (DW_TAG_union_type)
    <1ff>   DW_AT_byte_size   : 16
    <200>   DW_AT_decl_file   : 1
    <201>   DW_AT_decl_line   : 36
    <202>   DW_AT_decl_column : 9
    <203>   DW_AT_sibling     : <0x220>
 <2><207>: Abbrev Number: 12 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x116fb9): array
    <20c>   DW_AT_decl_file   : 1
    <20d>   DW_AT_decl_line   : 37
    <20e>   DW_AT_decl_column : 11
    <20f>   DW_AT_type        : <0x220>
 <2><213>: Abbrev Number: 12 (DW_TAG_member)
    <214>   DW_AT_name        : (indirect string, offset: 0x1020d0): element
    <218>   DW_AT_decl_file   : 1
    <219>   DW_AT_decl_line   : 44
    <21a>   DW_AT_decl_column : 7
    <21b>   DW_AT_type        : <0x1c8>
 <2><21f>: Abbrev Number: 0
 <1><220>: Abbrev Number: 13 (DW_TAG_array_type)
    <221>   DW_AT_type        : <0x107>
    <225>   DW_AT_sibling     : <0x230>
 <2><229>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <22a>   DW_AT_type        : <0x68>
    <22e>   DW_AT_upper_bound : 3
 <2><22f>: Abbrev Number: 0
 <1><230>: Abbrev Number: 7 (DW_TAG_typedef)
    <231>   DW_AT_name        : (indirect string, offset: 0x92bc5): FusionQuaternion
    <235>   DW_AT_decl_file   : 1
    <236>   DW_AT_decl_line   : 45
    <237>   DW_AT_decl_column : 3
    <238>   DW_AT_type        : <0x1fe>
 <1><23c>: Abbrev Number: 4 (DW_TAG_const_type)
    <23d>   DW_AT_type        : <0x230>
 <1><241>: Abbrev Number: 5 (DW_TAG_structure_type)
    <242>   DW_AT_byte_size   : 36
    <243>   DW_AT_decl_file   : 1
    <244>   DW_AT_decl_line   : 54
    <245>   DW_AT_decl_column : 5
    <246>   DW_AT_sibling     : <0x2b7>
 <2><24a>: Abbrev Number: 10 (DW_TAG_member)
    <24b>   DW_AT_name        : xx
    <24e>   DW_AT_decl_file   : 1
    <24f>   DW_AT_decl_line   : 55
    <250>   DW_AT_decl_column : 15
    <251>   DW_AT_type        : <0x107>
    <255>   DW_AT_data_member_location: 0
 <2><256>: Abbrev Number: 10 (DW_TAG_member)
    <257>   DW_AT_name        : xy
    <25a>   DW_AT_decl_file   : 1
    <25b>   DW_AT_decl_line   : 56
    <25c>   DW_AT_decl_column : 15
    <25d>   DW_AT_type        : <0x107>
    <261>   DW_AT_data_member_location: 4
 <2><262>: Abbrev Number: 10 (DW_TAG_member)
    <263>   DW_AT_name        : xz
    <266>   DW_AT_decl_file   : 1
    <267>   DW_AT_decl_line   : 57
    <268>   DW_AT_decl_column : 15
    <269>   DW_AT_type        : <0x107>
    <26d>   DW_AT_data_member_location: 8
 <2><26e>: Abbrev Number: 10 (DW_TAG_member)
    <26f>   DW_AT_name        : yx
    <272>   DW_AT_decl_file   : 1
    <273>   DW_AT_decl_line   : 58
    <274>   DW_AT_decl_column : 15
    <275>   DW_AT_type        : <0x107>
    <279>   DW_AT_data_member_location: 12
 <2><27a>: Abbrev Number: 10 (DW_TAG_member)
    <27b>   DW_AT_name        : yy
    <27e>   DW_AT_decl_file   : 1
    <27f>   DW_AT_decl_line   : 59
    <280>   DW_AT_decl_column : 15
    <281>   DW_AT_type        : <0x107>
    <285>   DW_AT_data_member_location: 16
 <2><286>: Abbrev Number: 10 (DW_TAG_member)
    <287>   DW_AT_name        : yz
    <28a>   DW_AT_decl_file   : 1
    <28b>   DW_AT_decl_line   : 60
    <28c>   DW_AT_decl_column : 15
    <28d>   DW_AT_type        : <0x107>
    <291>   DW_AT_data_member_location: 20
 <2><292>: Abbrev Number: 10 (DW_TAG_member)
    <293>   DW_AT_name        : zx
    <296>   DW_AT_decl_file   : 1
    <297>   DW_AT_decl_line   : 61
    <298>   DW_AT_decl_column : 15
    <299>   DW_AT_type        : <0x107>
    <29d>   DW_AT_data_member_location: 24
 <2><29e>: Abbrev Number: 10 (DW_TAG_member)
    <29f>   DW_AT_name        : zy
    <2a2>   DW_AT_decl_file   : 1
    <2a3>   DW_AT_decl_line   : 62
    <2a4>   DW_AT_decl_column : 15
    <2a5>   DW_AT_type        : <0x107>
    <2a9>   DW_AT_data_member_location: 28
 <2><2aa>: Abbrev Number: 10 (DW_TAG_member)
    <2ab>   DW_AT_name        : zz
    <2ae>   DW_AT_decl_file   : 1
    <2af>   DW_AT_decl_line   : 63
    <2b0>   DW_AT_decl_column : 15
    <2b1>   DW_AT_type        : <0x107>
    <2b5>   DW_AT_data_member_location: 32
 <2><2b6>: Abbrev Number: 0
 <1><2b7>: Abbrev Number: 11 (DW_TAG_union_type)
    <2b8>   DW_AT_byte_size   : 36
    <2b9>   DW_AT_decl_file   : 1
    <2ba>   DW_AT_decl_line   : 51
    <2bb>   DW_AT_decl_column : 9
    <2bc>   DW_AT_sibling     : <0x2d9>
 <2><2c0>: Abbrev Number: 12 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x116fb9): array
    <2c5>   DW_AT_decl_file   : 1
    <2c6>   DW_AT_decl_line   : 52
    <2c7>   DW_AT_decl_column : 11
    <2c8>   DW_AT_type        : <0x2d9>
 <2><2cc>: Abbrev Number: 12 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x1020d0): element
    <2d1>   DW_AT_decl_file   : 1
    <2d2>   DW_AT_decl_line   : 64
    <2d3>   DW_AT_decl_column : 7
    <2d4>   DW_AT_type        : <0x241>
 <2><2d8>: Abbrev Number: 0
 <1><2d9>: Abbrev Number: 13 (DW_TAG_array_type)
    <2da>   DW_AT_type        : <0x107>
    <2de>   DW_AT_sibling     : <0x2ef>
 <2><2e2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2e3>   DW_AT_type        : <0x68>
    <2e7>   DW_AT_upper_bound : 2
 <2><2e8>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2e9>   DW_AT_type        : <0x68>
    <2ed>   DW_AT_upper_bound : 2
 <2><2ee>: Abbrev Number: 0
 <1><2ef>: Abbrev Number: 7 (DW_TAG_typedef)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x2956c): FusionMatrix
    <2f4>   DW_AT_decl_file   : 1
    <2f5>   DW_AT_decl_line   : 65
    <2f6>   DW_AT_decl_column : 3
    <2f7>   DW_AT_type        : <0x2b7>
 <1><2fb>: Abbrev Number: 4 (DW_TAG_const_type)
    <2fc>   DW_AT_type        : <0x2ef>
 <1><300>: Abbrev Number: 5 (DW_TAG_structure_type)
    <301>   DW_AT_byte_size   : 12
    <302>   DW_AT_decl_file   : 1
    <303>   DW_AT_decl_line   : 74
    <304>   DW_AT_decl_column : 5
    <305>   DW_AT_sibling     : <0x331>
 <2><309>: Abbrev Number: 6 (DW_TAG_member)
    <30a>   DW_AT_name        : (indirect string, offset: 0xd2d41): roll
    <30e>   DW_AT_decl_file   : 1
    <30f>   DW_AT_decl_line   : 75
    <310>   DW_AT_decl_column : 15
    <311>   DW_AT_type        : <0x107>
    <315>   DW_AT_data_member_location: 0
 <2><316>: Abbrev Number: 6 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0x3e0ba): pitch
    <31b>   DW_AT_decl_file   : 1
    <31c>   DW_AT_decl_line   : 76
    <31d>   DW_AT_decl_column : 15
    <31e>   DW_AT_type        : <0x107>
    <322>   DW_AT_data_member_location: 4
 <2><323>: Abbrev Number: 10 (DW_TAG_member)
    <324>   DW_AT_name        : yaw
    <328>   DW_AT_decl_file   : 1
    <329>   DW_AT_decl_line   : 77
    <32a>   DW_AT_decl_column : 15
    <32b>   DW_AT_type        : <0x107>
    <32f>   DW_AT_data_member_location: 8
 <2><330>: Abbrev Number: 0
 <1><331>: Abbrev Number: 11 (DW_TAG_union_type)
    <332>   DW_AT_byte_size   : 12
    <333>   DW_AT_decl_file   : 1
    <334>   DW_AT_decl_line   : 71
    <335>   DW_AT_decl_column : 9
    <336>   DW_AT_sibling     : <0x353>
 <2><33a>: Abbrev Number: 12 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x116fb9): array
    <33f>   DW_AT_decl_file   : 1
    <340>   DW_AT_decl_line   : 72
    <341>   DW_AT_decl_column : 11
    <342>   DW_AT_type        : <0x1a7>
 <2><346>: Abbrev Number: 12 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x104e93): angle
    <34b>   DW_AT_decl_file   : 1
    <34c>   DW_AT_decl_line   : 78
    <34d>   DW_AT_decl_column : 7
    <34e>   DW_AT_type        : <0x300>
 <2><352>: Abbrev Number: 0
 <1><353>: Abbrev Number: 7 (DW_TAG_typedef)
    <354>   DW_AT_name        : (indirect string, offset: 0x82aa): FusionEuler
    <358>   DW_AT_decl_file   : 1
    <359>   DW_AT_decl_line   : 79
    <35a>   DW_AT_decl_column : 3
    <35b>   DW_AT_type        : <0x331>
 <1><35f>: Abbrev Number: 4 (DW_TAG_const_type)
    <360>   DW_AT_type        : <0x353>
 <1><364>: Abbrev Number: 5 (DW_TAG_structure_type)
    <365>   DW_AT_byte_size   : 20
    <366>   DW_AT_decl_file   : 6
    <367>   DW_AT_decl_line   : 24
    <368>   DW_AT_decl_column : 9
    <369>   DW_AT_sibling     : <0x3af>
 <2><36d>: Abbrev Number: 6 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x28309): convention
    <372>   DW_AT_decl_file   : 6
    <373>   DW_AT_decl_line   : 25
    <374>   DW_AT_decl_column : 22
    <375>   DW_AT_type        : <0x140>
    <379>   DW_AT_data_member_location: 0
 <2><37a>: Abbrev Number: 6 (DW_TAG_member)
    <37b>   DW_AT_name        : (indirect string, offset: 0x106b74): gain
    <37f>   DW_AT_decl_file   : 6
    <380>   DW_AT_decl_line   : 26
    <381>   DW_AT_decl_column : 11
    <382>   DW_AT_type        : <0x107>
    <386>   DW_AT_data_member_location: 4
 <2><387>: Abbrev Number: 6 (DW_TAG_member)
    <388>   DW_AT_name        : (indirect string, offset: 0x34742): accelerationRejection
    <38c>   DW_AT_decl_file   : 6
    <38d>   DW_AT_decl_line   : 27
    <38e>   DW_AT_decl_column : 11
    <38f>   DW_AT_type        : <0x107>
    <393>   DW_AT_data_member_location: 8
 <2><394>: Abbrev Number: 6 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x2cdb): magneticRejection
    <399>   DW_AT_decl_file   : 6
    <39a>   DW_AT_decl_line   : 28
    <39b>   DW_AT_decl_column : 11
    <39c>   DW_AT_type        : <0x107>
    <3a0>   DW_AT_data_member_location: 12
 <2><3a1>: Abbrev Number: 6 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x34e7f): rejectionTimeout
    <3a6>   DW_AT_decl_file   : 6
    <3a7>   DW_AT_decl_line   : 29
    <3a8>   DW_AT_decl_column : 18
    <3a9>   DW_AT_type        : <0x68>
    <3ad>   DW_AT_data_member_location: 16
 <2><3ae>: Abbrev Number: 0
 <1><3af>: Abbrev Number: 7 (DW_TAG_typedef)
    <3b0>   DW_AT_name        : (indirect string, offset: 0xbfa9f): FusionAhrsSettings
    <3b4>   DW_AT_decl_file   : 6
    <3b5>   DW_AT_decl_line   : 30
    <3b6>   DW_AT_decl_column : 3
    <3b7>   DW_AT_type        : <0x364>
 <1><3bb>: Abbrev Number: 4 (DW_TAG_const_type)
    <3bc>   DW_AT_type        : <0x3af>
 <1><3c0>: Abbrev Number: 5 (DW_TAG_structure_type)
    <3c1>   DW_AT_byte_size   : 104
    <3c2>   DW_AT_decl_file   : 6
    <3c3>   DW_AT_decl_line   : 36
    <3c4>   DW_AT_decl_column : 9
    <3c5>   DW_AT_sibling     : <0x480>
 <2><3c9>: Abbrev Number: 6 (DW_TAG_member)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x5a5d7): settings
    <3ce>   DW_AT_decl_file   : 6
    <3cf>   DW_AT_decl_line   : 37
    <3d0>   DW_AT_decl_column : 24
    <3d1>   DW_AT_type        : <0x3af>
    <3d5>   DW_AT_data_member_location: 0
 <2><3d6>: Abbrev Number: 6 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x28dc6): quaternion
    <3db>   DW_AT_decl_file   : 6
    <3dc>   DW_AT_decl_line   : 38
    <3dd>   DW_AT_decl_column : 22
    <3de>   DW_AT_type        : <0x230>
    <3e2>   DW_AT_data_member_location: 20
 <2><3e3>: Abbrev Number: 6 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0xb668e): accelerometer
    <3e8>   DW_AT_decl_file   : 6
    <3e9>   DW_AT_decl_line   : 39
    <3ea>   DW_AT_decl_column : 18
    <3eb>   DW_AT_type        : <0x1b7>
    <3ef>   DW_AT_data_member_location: 36
 <2><3f0>: Abbrev Number: 6 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xb8811): initialising
    <3f5>   DW_AT_decl_file   : 6
    <3f6>   DW_AT_decl_line   : 40
    <3f7>   DW_AT_decl_column : 10
    <3f8>   DW_AT_type        : <0x480>
    <3fc>   DW_AT_data_member_location: 48
 <2><3fd>: Abbrev Number: 6 (DW_TAG_member)
    <3fe>   DW_AT_name        : (indirect string, offset: 0xe919e): rampedGain
    <402>   DW_AT_decl_file   : 6
    <403>   DW_AT_decl_line   : 41
    <404>   DW_AT_decl_column : 11
    <405>   DW_AT_type        : <0x107>
    <409>   DW_AT_data_member_location: 52
 <2><40a>: Abbrev Number: 6 (DW_TAG_member)
    <40b>   DW_AT_name        : (indirect string, offset: 0x2c457): rampedGainStep
    <40f>   DW_AT_decl_file   : 6
    <410>   DW_AT_decl_line   : 42
    <411>   DW_AT_decl_column : 11
    <412>   DW_AT_type        : <0x107>
    <416>   DW_AT_data_member_location: 56
 <2><417>: Abbrev Number: 6 (DW_TAG_member)
    <418>   DW_AT_name        : (indirect string, offset: 0x8ca62): halfAccelerometerFeedback
    <41c>   DW_AT_decl_file   : 6
    <41d>   DW_AT_decl_line   : 43
    <41e>   DW_AT_decl_column : 18
    <41f>   DW_AT_type        : <0x1b7>
    <423>   DW_AT_data_member_location: 60
 <2><424>: Abbrev Number: 6 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x9af2f): halfMagnetometerFeedback
    <429>   DW_AT_decl_file   : 6
    <42a>   DW_AT_decl_line   : 44
    <42b>   DW_AT_decl_column : 18
    <42c>   DW_AT_type        : <0x1b7>
    <430>   DW_AT_data_member_location: 72
 <2><431>: Abbrev Number: 6 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0xac1ce): accelerometerIgnored
    <436>   DW_AT_decl_file   : 6
    <437>   DW_AT_decl_line   : 45
    <438>   DW_AT_decl_column : 10
    <439>   DW_AT_type        : <0x480>
    <43d>   DW_AT_data_member_location: 84
 <2><43e>: Abbrev Number: 6 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0xe6e3d): accelerationRejectionTimer
    <443>   DW_AT_decl_file   : 6
    <444>   DW_AT_decl_line   : 46
    <445>   DW_AT_decl_column : 18
    <446>   DW_AT_type        : <0x68>
    <44a>   DW_AT_data_member_location: 88
 <2><44b>: Abbrev Number: 6 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0xf21b9): accelerationRejectionTimeout
    <450>   DW_AT_decl_file   : 6
    <451>   DW_AT_decl_line   : 47
    <452>   DW_AT_decl_column : 10
    <453>   DW_AT_type        : <0x480>
    <457>   DW_AT_data_member_location: 92
 <2><458>: Abbrev Number: 6 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x46163): magnetometerIgnored
    <45d>   DW_AT_decl_file   : 6
    <45e>   DW_AT_decl_line   : 48
    <45f>   DW_AT_decl_column : 10
    <460>   DW_AT_type        : <0x480>
    <464>   DW_AT_data_member_location: 93
 <2><465>: Abbrev Number: 6 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x4336d): magneticRejectionTimer
    <46a>   DW_AT_decl_file   : 6
    <46b>   DW_AT_decl_line   : 49
    <46c>   DW_AT_decl_column : 18
    <46d>   DW_AT_type        : <0x68>
    <471>   DW_AT_data_member_location: 96
 <2><472>: Abbrev Number: 6 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x43caf): magneticRejectionTimeout
    <477>   DW_AT_decl_file   : 6
    <478>   DW_AT_decl_line   : 50
    <479>   DW_AT_decl_column : 10
    <47a>   DW_AT_type        : <0x480>
    <47e>   DW_AT_data_member_location: 100
 <2><47f>: Abbrev Number: 0
 <1><480>: Abbrev Number: 2 (DW_TAG_base_type)
    <481>   DW_AT_byte_size   : 1
    <482>   DW_AT_encoding    : 2	(boolean)
    <483>   DW_AT_name        : (indirect string, offset: 0x69bfc): _Bool
 <1><487>: Abbrev Number: 7 (DW_TAG_typedef)
    <488>   DW_AT_name        : (indirect string, offset: 0xe1ef2): FusionAhrs
    <48c>   DW_AT_decl_file   : 6
    <48d>   DW_AT_decl_line   : 51
    <48e>   DW_AT_decl_column : 3
    <48f>   DW_AT_type        : <0x3c0>
 <1><493>: Abbrev Number: 4 (DW_TAG_const_type)
    <494>   DW_AT_type        : <0x487>
 <1><498>: Abbrev Number: 5 (DW_TAG_structure_type)
    <499>   DW_AT_byte_size   : 24
    <49a>   DW_AT_decl_file   : 7
    <49b>   DW_AT_decl_line   : 23
    <49c>   DW_AT_decl_column : 9
    <49d>   DW_AT_sibling     : <0x4d6>
 <2><4a1>: Abbrev Number: 6 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0xed200): filterCoefficient
    <4a6>   DW_AT_decl_file   : 7
    <4a7>   DW_AT_decl_line   : 24
    <4a8>   DW_AT_decl_column : 11
    <4a9>   DW_AT_type        : <0x107>
    <4ad>   DW_AT_data_member_location: 0
 <2><4ae>: Abbrev Number: 6 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x79dc0): timeout
    <4b3>   DW_AT_decl_file   : 7
    <4b4>   DW_AT_decl_line   : 25
    <4b5>   DW_AT_decl_column : 18
    <4b6>   DW_AT_type        : <0x68>
    <4ba>   DW_AT_data_member_location: 4
 <2><4bb>: Abbrev Number: 6 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xf2553): timer
    <4c0>   DW_AT_decl_file   : 7
    <4c1>   DW_AT_decl_line   : 26
    <4c2>   DW_AT_decl_column : 18
    <4c3>   DW_AT_type        : <0x68>
    <4c7>   DW_AT_data_member_location: 8
 <2><4c8>: Abbrev Number: 6 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xcabea): gyroscopeOffset
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 27
    <4cf>   DW_AT_decl_column : 18
    <4d0>   DW_AT_type        : <0x1b7>
    <4d4>   DW_AT_data_member_location: 12
 <2><4d5>: Abbrev Number: 0
 <1><4d6>: Abbrev Number: 7 (DW_TAG_typedef)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x39411): FusionOffset
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 28
    <4dd>   DW_AT_decl_column : 3
    <4de>   DW_AT_type        : <0x498>
 <1><4e2>: Abbrev Number: 7 (DW_TAG_typedef)
    <4e3>   DW_AT_name        : (indirect string, offset: 0xf0427): clock_t
    <4e7>   DW_AT_decl_file   : 8
    <4e8>   DW_AT_decl_line   : 107
    <4e9>   DW_AT_decl_column : 19
    <4ea>   DW_AT_type        : <0x4c>
 <1><4ee>: Abbrev Number: 4 (DW_TAG_const_type)
    <4ef>   DW_AT_type        : <0x4e2>
 <1><4f3>: Abbrev Number: 15 (DW_TAG_variable)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x82041): gyroscopeMisalignment
    <4f8>   DW_AT_decl_file   : 3
    <4f9>   DW_AT_decl_line   : 19
    <4fa>   DW_AT_decl_column : 20
    <4fb>   DW_AT_type        : <0x2fb>
    <4ff>   DW_AT_external    : 1
    <4ff>   DW_AT_location    : 5 byte block: 3 18 6 1 8 	(DW_OP_addr: 8010618)
 <1><505>: Abbrev Number: 15 (DW_TAG_variable)
    <506>   DW_AT_name        : (indirect string, offset: 0x9258d): gyroscopeSensitivity
    <50a>   DW_AT_decl_file   : 3
    <50b>   DW_AT_decl_line   : 20
    <50c>   DW_AT_decl_column : 20
    <50d>   DW_AT_type        : <0x1c3>
    <511>   DW_AT_external    : 1
    <511>   DW_AT_location    : 5 byte block: 3 3c 6 1 8 	(DW_OP_addr: 801063c)
 <1><517>: Abbrev Number: 15 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0xcabea): gyroscopeOffset
    <51c>   DW_AT_decl_file   : 3
    <51d>   DW_AT_decl_line   : 21
    <51e>   DW_AT_decl_column : 20
    <51f>   DW_AT_type        : <0x1c3>
    <523>   DW_AT_external    : 1
    <523>   DW_AT_location    : 5 byte block: 3 48 6 1 8 	(DW_OP_addr: 8010648)
 <1><529>: Abbrev Number: 15 (DW_TAG_variable)
    <52a>   DW_AT_name        : (indirect string, offset: 0x696c1): accelerometerMisalignment
    <52e>   DW_AT_decl_file   : 3
    <52f>   DW_AT_decl_line   : 22
    <530>   DW_AT_decl_column : 20
    <531>   DW_AT_type        : <0x2fb>
    <535>   DW_AT_external    : 1
    <535>   DW_AT_location    : 5 byte block: 3 54 6 1 8 	(DW_OP_addr: 8010654)
 <1><53b>: Abbrev Number: 15 (DW_TAG_variable)
    <53c>   DW_AT_name        : (indirect string, offset: 0x2f626): accelerometerSensitivity
    <540>   DW_AT_decl_file   : 3
    <541>   DW_AT_decl_line   : 23
    <542>   DW_AT_decl_column : 20
    <543>   DW_AT_type        : <0x1c3>
    <547>   DW_AT_external    : 1
    <547>   DW_AT_location    : 5 byte block: 3 78 6 1 8 	(DW_OP_addr: 8010678)
 <1><54d>: Abbrev Number: 15 (DW_TAG_variable)
    <54e>   DW_AT_name        : (indirect string, offset: 0x102e4d): accelerometerOffset
    <552>   DW_AT_decl_file   : 3
    <553>   DW_AT_decl_line   : 24
    <554>   DW_AT_decl_column : 20
    <555>   DW_AT_type        : <0x1c3>
    <559>   DW_AT_external    : 1
    <559>   DW_AT_location    : 5 byte block: 3 84 6 1 8 	(DW_OP_addr: 8010684)
 <1><55f>: Abbrev Number: 15 (DW_TAG_variable)
    <560>   DW_AT_name        : (indirect string, offset: 0x1d334): softIronMatrix
    <564>   DW_AT_decl_file   : 3
    <565>   DW_AT_decl_line   : 25
    <566>   DW_AT_decl_column : 20
    <567>   DW_AT_type        : <0x2fb>
    <56b>   DW_AT_external    : 1
    <56b>   DW_AT_location    : 5 byte block: 3 90 6 1 8 	(DW_OP_addr: 8010690)
 <1><571>: Abbrev Number: 15 (DW_TAG_variable)
    <572>   DW_AT_name        : (indirect string, offset: 0x1b71b): hardIronOffset
    <576>   DW_AT_decl_file   : 3
    <577>   DW_AT_decl_line   : 26
    <578>   DW_AT_decl_column : 20
    <579>   DW_AT_type        : <0x1c3>
    <57d>   DW_AT_external    : 1
    <57d>   DW_AT_location    : 5 byte block: 3 b4 6 1 8 	(DW_OP_addr: 80106b4)
 <1><583>: Abbrev Number: 15 (DW_TAG_variable)
    <584>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <588>   DW_AT_decl_file   : 3
    <589>   DW_AT_decl_line   : 28
    <58a>   DW_AT_decl_column : 12
    <58b>   DW_AT_type        : <0x487>
    <58f>   DW_AT_external    : 1
    <58f>   DW_AT_location    : 5 byte block: 3 fc 1 0 20 	(DW_OP_addr: 200001fc)
 <1><595>: Abbrev Number: 15 (DW_TAG_variable)
    <596>   DW_AT_name        : (indirect string, offset: 0xde318): offset
    <59a>   DW_AT_decl_file   : 3
    <59b>   DW_AT_decl_line   : 29
    <59c>   DW_AT_decl_column : 14
    <59d>   DW_AT_type        : <0x4d6>
    <5a1>   DW_AT_external    : 1
    <5a1>   DW_AT_location    : 5 byte block: 3 64 2 0 20 	(DW_OP_addr: 20000264)
 <1><5a7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <5a8>   DW_AT_external    : 1
    <5a8>   DW_AT_name        : (indirect string, offset: 0x8d463): FusionAhrsUpdate
    <5ac>   DW_AT_decl_file   : 6
    <5ad>   DW_AT_decl_line   : 85
    <5ae>   DW_AT_decl_column : 6
    <5af>   DW_AT_prototyped  : 1
    <5af>   DW_AT_declaration : 1
    <5af>   DW_AT_sibling     : <0x5cd>
 <2><5b3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5b4>   DW_AT_type        : <0x5d3>
 <2><5b8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5b9>   DW_AT_type        : <0x1c3>
 <2><5bd>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5be>   DW_AT_type        : <0x1c3>
 <2><5c2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5c3>   DW_AT_type        : <0x1c3>
 <2><5c7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5c8>   DW_AT_type        : <0x10e>
 <2><5cc>: Abbrev Number: 0
 <1><5cd>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5ce>   DW_AT_byte_size   : 4
    <5cf>   DW_AT_type        : <0x487>
 <1><5d3>: Abbrev Number: 4 (DW_TAG_const_type)
    <5d4>   DW_AT_type        : <0x5cd>
 <1><5d8>: Abbrev Number: 19 (DW_TAG_subprogram)
    <5d9>   DW_AT_external    : 1
    <5d9>   DW_AT_name        : (indirect string, offset: 0x676b8): FusionOffsetUpdate
    <5dd>   DW_AT_decl_file   : 7
    <5de>   DW_AT_decl_line   : 35
    <5df>   DW_AT_decl_column : 14
    <5e0>   DW_AT_prototyped  : 1
    <5e0>   DW_AT_type        : <0x1b7>
    <5e4>   DW_AT_declaration : 1
    <5e4>   DW_AT_sibling     : <0x5f3>
 <2><5e8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5e9>   DW_AT_type        : <0x5f9>
 <2><5ed>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5ee>   DW_AT_type        : <0x1b7>
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5f4>   DW_AT_byte_size   : 4
    <5f5>   DW_AT_type        : <0x4d6>
 <1><5f9>: Abbrev Number: 4 (DW_TAG_const_type)
    <5fa>   DW_AT_type        : <0x5f3>
 <1><5fe>: Abbrev Number: 20 (DW_TAG_subprogram)
    <5ff>   DW_AT_external    : 1
    <5ff>   DW_AT_name        : (indirect string, offset: 0x30c6c): asinf
    <603>   DW_AT_decl_file   : 9
    <604>   DW_AT_decl_line   : 367
    <606>   DW_AT_decl_column : 14
    <607>   DW_AT_prototyped  : 1
    <607>   DW_AT_type        : <0x107>
    <60b>   DW_AT_declaration : 1
    <60b>   DW_AT_sibling     : <0x615>
 <2><60f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <610>   DW_AT_type        : <0x107>
 <2><614>: Abbrev Number: 0
 <1><615>: Abbrev Number: 20 (DW_TAG_subprogram)
    <616>   DW_AT_external    : 1
    <616>   DW_AT_name        : (indirect string, offset: 0x82f9a): atan2f
    <61a>   DW_AT_decl_file   : 9
    <61b>   DW_AT_decl_line   : 368
    <61d>   DW_AT_decl_column : 14
    <61e>   DW_AT_prototyped  : 1
    <61e>   DW_AT_type        : <0x107>
    <622>   DW_AT_declaration : 1
    <622>   DW_AT_sibling     : <0x631>
 <2><626>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <627>   DW_AT_type        : <0x107>
 <2><62b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <62c>   DW_AT_type        : <0x107>
 <2><630>: Abbrev Number: 0
 <1><631>: Abbrev Number: 19 (DW_TAG_subprogram)
    <632>   DW_AT_external    : 1
    <632>   DW_AT_name        : (indirect string, offset: 0xad853): FusionAhrsGetQuaternion
    <636>   DW_AT_decl_file   : 6
    <637>   DW_AT_decl_line   : 91
    <638>   DW_AT_decl_column : 18
    <639>   DW_AT_prototyped  : 1
    <639>   DW_AT_type        : <0x230>
    <63d>   DW_AT_declaration : 1
    <63d>   DW_AT_sibling     : <0x647>
 <2><641>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <642>   DW_AT_type        : <0x64d>
 <2><646>: Abbrev Number: 0
 <1><647>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <649>   DW_AT_type        : <0x493>
 <1><64d>: Abbrev Number: 4 (DW_TAG_const_type)
    <64e>   DW_AT_type        : <0x647>
 <1><652>: Abbrev Number: 16 (DW_TAG_subprogram)
    <653>   DW_AT_external    : 1
    <653>   DW_AT_name        : (indirect string, offset: 0xeef48): FusionAhrsUpdateNoMagnetometer
    <657>   DW_AT_decl_file   : 6
    <658>   DW_AT_decl_line   : 87
    <659>   DW_AT_decl_column : 6
    <65a>   DW_AT_prototyped  : 1
    <65a>   DW_AT_declaration : 1
    <65a>   DW_AT_sibling     : <0x673>
 <2><65e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <65f>   DW_AT_type        : <0x5d3>
 <2><663>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <664>   DW_AT_type        : <0x1c3>
 <2><668>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <669>   DW_AT_type        : <0x1c3>
 <2><66d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <66e>   DW_AT_type        : <0x10e>
 <2><672>: Abbrev Number: 0
 <1><673>: Abbrev Number: 16 (DW_TAG_subprogram)
    <674>   DW_AT_external    : 1
    <674>   DW_AT_name        : (indirect string, offset: 0x773e5): FusionAhrsSetSettings
    <678>   DW_AT_decl_file   : 6
    <679>   DW_AT_decl_line   : 83
    <67a>   DW_AT_decl_column : 6
    <67b>   DW_AT_prototyped  : 1
    <67b>   DW_AT_declaration : 1
    <67b>   DW_AT_sibling     : <0x68a>
 <2><67f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <680>   DW_AT_type        : <0x5d3>
 <2><684>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <685>   DW_AT_type        : <0x690>
 <2><689>: Abbrev Number: 0
 <1><68a>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <68b>   DW_AT_byte_size   : 4
    <68c>   DW_AT_type        : <0x3bb>
 <1><690>: Abbrev Number: 4 (DW_TAG_const_type)
    <691>   DW_AT_type        : <0x68a>
 <1><695>: Abbrev Number: 16 (DW_TAG_subprogram)
    <696>   DW_AT_external    : 1
    <696>   DW_AT_name        : (indirect string, offset: 0x7f706): FusionAhrsInitialise
    <69a>   DW_AT_decl_file   : 6
    <69b>   DW_AT_decl_line   : 79
    <69c>   DW_AT_decl_column : 6
    <69d>   DW_AT_prototyped  : 1
    <69d>   DW_AT_declaration : 1
    <69d>   DW_AT_sibling     : <0x6a7>
 <2><6a1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <6a2>   DW_AT_type        : <0x5d3>
 <2><6a6>: Abbrev Number: 0
 <1><6a7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <6a8>   DW_AT_external    : 1
    <6a8>   DW_AT_name        : (indirect string, offset: 0x165e8): FusionOffsetInitialise
    <6ac>   DW_AT_decl_file   : 7
    <6ad>   DW_AT_decl_line   : 33
    <6ae>   DW_AT_decl_column : 6
    <6af>   DW_AT_prototyped  : 1
    <6af>   DW_AT_declaration : 1
    <6af>   DW_AT_sibling     : <0x6be>
 <2><6b3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <6b4>   DW_AT_type        : <0x5f9>
 <2><6b8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <6b9>   DW_AT_type        : <0x6f>
 <2><6bd>: Abbrev Number: 0
 <1><6be>: Abbrev Number: 21 (DW_TAG_subprogram)
    <6bf>   DW_AT_external    : 1
    <6bf>   DW_AT_name        : (indirect string, offset: 0x4b717): FusionCalcHeading
    <6c3>   DW_AT_decl_file   : 3
    <6c4>   DW_AT_decl_line   : 57
    <6c5>   DW_AT_decl_column : 6
    <6c6>   DW_AT_prototyped  : 1
    <6c6>   DW_AT_low_pc      : 0x8001608
    <6ca>   DW_AT_high_pc     : 0x2dc
    <6ce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6d0>   DW_AT_GNU_all_tail_call_sites: 1
    <6d0>   DW_AT_sibling     : <0x754>
 <2><6d4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x859a9): memsData
    <6d9>   DW_AT_decl_file   : 3
    <6da>   DW_AT_decl_line   : 57
    <6db>   DW_AT_decl_column : 37
    <6dc>   DW_AT_type        : <0x754>
    <6e0>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><6e4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x75e84): output_angles
    <6e9>   DW_AT_decl_file   : 3
    <6ea>   DW_AT_decl_line   : 57
    <6eb>   DW_AT_decl_column : 60
    <6ec>   DW_AT_type        : <0x75a>
    <6f0>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><6f4>: Abbrev Number: 23 (DW_TAG_variable)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x8a9d8): timestamp
    <6f9>   DW_AT_decl_file   : 3
    <6fa>   DW_AT_decl_line   : 58
    <6fb>   DW_AT_decl_column : 16
    <6fc>   DW_AT_type        : <0x4ee>
    <700>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><703>: Abbrev Number: 23 (DW_TAG_variable)
    <704>   DW_AT_name        : (indirect string, offset: 0x742fd): gyroscope
    <708>   DW_AT_decl_file   : 3
    <709>   DW_AT_decl_line   : 59
    <70a>   DW_AT_decl_column : 15
    <70b>   DW_AT_type        : <0x1b7>
    <70f>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><712>: Abbrev Number: 23 (DW_TAG_variable)
    <713>   DW_AT_name        : (indirect string, offset: 0xb668e): accelerometer
    <717>   DW_AT_decl_file   : 3
    <718>   DW_AT_decl_line   : 60
    <719>   DW_AT_decl_column : 15
    <71a>   DW_AT_type        : <0x1b7>
    <71e>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><722>: Abbrev Number: 23 (DW_TAG_variable)
    <723>   DW_AT_name        : (indirect string, offset: 0x8105d): magnetometer
    <727>   DW_AT_decl_file   : 3
    <728>   DW_AT_decl_line   : 61
    <729>   DW_AT_decl_column : 15
    <72a>   DW_AT_type        : <0x1b7>
    <72e>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><732>: Abbrev Number: 23 (DW_TAG_variable)
    <733>   DW_AT_name        : (indirect string, offset: 0xc9ea3): previousTimestamp
    <737>   DW_AT_decl_file   : 3
    <738>   DW_AT_decl_line   : 72
    <739>   DW_AT_decl_column : 17
    <73a>   DW_AT_type        : <0x4e2>
    <73e>   DW_AT_location    : 5 byte block: 3 7c 2 0 20 	(DW_OP_addr: 2000027c)
 <2><744>: Abbrev Number: 23 (DW_TAG_variable)
    <745>   DW_AT_name        : (indirect string, offset: 0xbdada): deltaTime
    <749>   DW_AT_decl_file   : 3
    <74a>   DW_AT_decl_line   : 73
    <74b>   DW_AT_decl_column : 14
    <74c>   DW_AT_type        : <0x10e>
    <750>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><753>: Abbrev Number: 0
 <1><754>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <755>   DW_AT_byte_size   : 4
    <756>   DW_AT_type        : <0x113>
 <1><75a>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <75b>   DW_AT_byte_size   : 4
    <75c>   DW_AT_type        : <0x353>
 <1><760>: Abbrev Number: 21 (DW_TAG_subprogram)
    <761>   DW_AT_external    : 1
    <761>   DW_AT_name        : (indirect string, offset: 0x1053a5): FusionCalcAngle
    <765>   DW_AT_decl_file   : 3
    <766>   DW_AT_decl_line   : 47
    <767>   DW_AT_decl_column : 6
    <768>   DW_AT_prototyped  : 1
    <768>   DW_AT_low_pc      : 0x0
    <76c>   DW_AT_high_pc     : 0xd8
    <770>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <772>   DW_AT_GNU_all_tail_call_sites: 1
    <772>   DW_AT_sibling     : <0x7b4>
 <2><776>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <777>   DW_AT_name        : (indirect string, offset: 0x859a9): memsData
    <77b>   DW_AT_decl_file   : 3
    <77c>   DW_AT_decl_line   : 47
    <77d>   DW_AT_decl_column : 35
    <77e>   DW_AT_type        : <0x754>
    <782>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><786>: Abbrev Number: 23 (DW_TAG_variable)
    <787>   DW_AT_name        : (indirect string, offset: 0x742fd): gyroscope
    <78b>   DW_AT_decl_file   : 3
    <78c>   DW_AT_decl_line   : 48
    <78d>   DW_AT_decl_column : 21
    <78e>   DW_AT_type        : <0x1c3>
    <792>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><795>: Abbrev Number: 23 (DW_TAG_variable)
    <796>   DW_AT_name        : (indirect string, offset: 0xb668e): accelerometer
    <79a>   DW_AT_decl_file   : 3
    <79b>   DW_AT_decl_line   : 49
    <79c>   DW_AT_decl_column : 21
    <79d>   DW_AT_type        : <0x1c3>
    <7a1>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><7a4>: Abbrev Number: 23 (DW_TAG_variable)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x3b432): euler
    <7a9>   DW_AT_decl_file   : 3
    <7aa>   DW_AT_decl_line   : 53
    <7ab>   DW_AT_decl_column : 20
    <7ac>   DW_AT_type        : <0x35f>
    <7b0>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><7b3>: Abbrev Number: 0
 <1><7b4>: Abbrev Number: 21 (DW_TAG_subprogram)
    <7b5>   DW_AT_external    : 1
    <7b5>   DW_AT_name        : (indirect string, offset: 0x2309c): FusionInit
    <7b9>   DW_AT_decl_file   : 3
    <7ba>   DW_AT_decl_line   : 32
    <7bb>   DW_AT_decl_column : 6
    <7bc>   DW_AT_prototyped  : 1
    <7bc>   DW_AT_low_pc      : 0x80015c8
    <7c0>   DW_AT_high_pc     : 0x40
    <7c4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c6>   DW_AT_GNU_all_tail_call_sites: 1
    <7c6>   DW_AT_sibling     : <0x7da>
 <2><7ca>: Abbrev Number: 23 (DW_TAG_variable)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x5a5d7): settings
    <7cf>   DW_AT_decl_file   : 3
    <7d0>   DW_AT_decl_line   : 35
    <7d1>   DW_AT_decl_column : 27
    <7d2>   DW_AT_type        : <0x3bb>
    <7d6>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><7d9>: Abbrev Number: 0
 <1><7da>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7db>   DW_AT_name        : (indirect string, offset: 0x6c27): FusionCalibrationMagnetic
    <7df>   DW_AT_decl_file   : 2
    <7e0>   DW_AT_decl_line   : 37
    <7e1>   DW_AT_decl_column : 28
    <7e2>   DW_AT_prototyped  : 1
    <7e2>   DW_AT_type        : <0x1b7>
    <7e6>   DW_AT_low_pc      : 0x80014ca
    <7ea>   DW_AT_high_pc     : 0xfe
    <7ee>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7f0>   DW_AT_GNU_all_tail_call_sites: 1
    <7f0>   DW_AT_sibling     : <0x824>
 <2><7f4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x4265b): uncalibrated
    <7f9>   DW_AT_decl_file   : 2
    <7fa>   DW_AT_decl_line   : 37
    <7fb>   DW_AT_decl_column : 73
    <7fc>   DW_AT_type        : <0x1c3>
    <800>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><804>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <805>   DW_AT_name        : (indirect string, offset: 0x1d334): softIronMatrix
    <809>   DW_AT_decl_file   : 2
    <80a>   DW_AT_decl_line   : 37
    <80b>   DW_AT_decl_column : 106
    <80c>   DW_AT_type        : <0x2fb>
    <810>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><813>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <814>   DW_AT_name        : (indirect string, offset: 0x1b71b): hardIronOffset
    <818>   DW_AT_decl_file   : 2
    <819>   DW_AT_decl_line   : 37
    <81a>   DW_AT_decl_column : 141
    <81b>   DW_AT_type        : <0x1c3>
    <81f>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><823>: Abbrev Number: 0
 <1><824>: Abbrev Number: 24 (DW_TAG_subprogram)
    <825>   DW_AT_name        : (indirect string, offset: 0x27b1d): FusionCalibrationInertial
    <829>   DW_AT_decl_file   : 2
    <82a>   DW_AT_decl_line   : 26
    <82b>   DW_AT_decl_column : 28
    <82c>   DW_AT_prototyped  : 1
    <82c>   DW_AT_type        : <0x1b7>
    <830>   DW_AT_low_pc      : 0x8001370
    <834>   DW_AT_high_pc     : 0x15a
    <838>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <83a>   DW_AT_GNU_all_tail_call_sites: 1
    <83a>   DW_AT_sibling     : <0x87e>
 <2><83e>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <83f>   DW_AT_name        : (indirect string, offset: 0x4265b): uncalibrated
    <843>   DW_AT_decl_file   : 2
    <844>   DW_AT_decl_line   : 26
    <845>   DW_AT_decl_column : 73
    <846>   DW_AT_type        : <0x1c3>
    <84a>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><84e>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <84f>   DW_AT_name        : (indirect string, offset: 0x4273e): misalignment
    <853>   DW_AT_decl_file   : 2
    <854>   DW_AT_decl_line   : 26
    <855>   DW_AT_decl_column : 106
    <856>   DW_AT_type        : <0x2fb>
    <85a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><85d>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <85e>   DW_AT_name        : (indirect string, offset: 0x1376e): sensitivity
    <862>   DW_AT_decl_file   : 2
    <863>   DW_AT_decl_line   : 26
    <864>   DW_AT_decl_column : 139
    <865>   DW_AT_type        : <0x1c3>
    <869>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><86d>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <86e>   DW_AT_name        : (indirect string, offset: 0xde318): offset
    <872>   DW_AT_decl_file   : 2
    <873>   DW_AT_decl_line   : 26
    <874>   DW_AT_decl_column : 171
    <875>   DW_AT_type        : <0x1c3>
    <879>   DW_AT_location    : 3 byte block: 91 94 7f 	(DW_OP_fbreg: -108)
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 25 (DW_TAG_subprogram)
    <87f>   DW_AT_name        : (indirect string, offset: 0xf8cfd): FusionQuaternionToEuler
    <883>   DW_AT_decl_file   : 1
    <884>   DW_AT_decl_line   : 456
    <886>   DW_AT_decl_column : 27
    <887>   DW_AT_prototyped  : 1
    <887>   DW_AT_type        : <0x353>
    <88b>   DW_AT_low_pc      : 0x8001224
    <88f>   DW_AT_high_pc     : 0x14c
    <893>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <895>   DW_AT_GNU_all_tail_call_sites: 1
    <895>   DW_AT_sibling     : <0x8ca>
 <2><899>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <89a>   DW_AT_name        : (indirect string, offset: 0x28dc6): quaternion
    <89e>   DW_AT_decl_file   : 1
    <89f>   DW_AT_decl_line   : 456
    <8a1>   DW_AT_decl_column : 74
    <8a2>   DW_AT_type        : <0x23c>
    <8a6>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><8a9>: Abbrev Number: 27 (DW_TAG_variable)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xa73a0): halfMinusQySquared
    <8ae>   DW_AT_decl_file   : 1
    <8af>   DW_AT_decl_line   : 458
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x10e>
    <8b6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8b9>: Abbrev Number: 27 (DW_TAG_variable)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x3b432): euler
    <8be>   DW_AT_decl_file   : 1
    <8bf>   DW_AT_decl_line   : 459
    <8c1>   DW_AT_decl_column : 23
    <8c2>   DW_AT_type        : <0x35f>
    <8c6>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><8c9>: Abbrev Number: 0
 <1><8ca>: Abbrev Number: 28 (DW_TAG_subprogram)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x104620): FusionMatrixMultiplyVector
    <8cf>   DW_AT_decl_file   : 1
    <8d0>   DW_AT_decl_line   : 408
    <8d2>   DW_AT_decl_column : 28
    <8d3>   DW_AT_prototyped  : 1
    <8d3>   DW_AT_type        : <0x1b7>
    <8d7>   DW_AT_low_pc      : 0x8001134
    <8db>   DW_AT_high_pc     : 0xf0
    <8df>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8e1>   DW_AT_GNU_all_call_sites: 1
    <8e1>   DW_AT_sibling     : <0x916>
 <2><8e5>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <8e6>   DW_AT_name        : (indirect string, offset: 0xd9c04): matrix
    <8ea>   DW_AT_decl_file   : 1
    <8eb>   DW_AT_decl_line   : 408
    <8ed>   DW_AT_decl_column : 74
    <8ee>   DW_AT_type        : <0x2fb>
    <8f2>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8f5>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x37116): vector
    <8fa>   DW_AT_decl_file   : 1
    <8fb>   DW_AT_decl_line   : 408
    <8fd>   DW_AT_decl_column : 101
    <8fe>   DW_AT_type        : <0x1c3>
    <902>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><905>: Abbrev Number: 27 (DW_TAG_variable)
    <906>   DW_AT_name        : (indirect string, offset: 0x883de): result
    <90a>   DW_AT_decl_file   : 1
    <90b>   DW_AT_decl_line   : 410
    <90d>   DW_AT_decl_column : 24
    <90e>   DW_AT_type        : <0x1c3>
    <912>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 29 (DW_TAG_subprogram)
    <917>   DW_AT_name        : (indirect string, offset: 0x27639): FusionVectorHadamardProduct
    <91b>   DW_AT_decl_file   : 1
    <91c>   DW_AT_decl_line   : 255
    <91d>   DW_AT_decl_column : 28
    <91e>   DW_AT_prototyped  : 1
    <91e>   DW_AT_type        : <0x1b7>
    <922>   DW_AT_low_pc      : 0x8001098
    <926>   DW_AT_high_pc     : 0x9c
    <92a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <92c>   DW_AT_GNU_all_call_sites: 1
    <92c>   DW_AT_sibling     : <0x95f>
 <2><930>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <931>   DW_AT_name        : (indirect string, offset: 0xa984e): vectorA
    <935>   DW_AT_decl_file   : 1
    <936>   DW_AT_decl_line   : 255
    <937>   DW_AT_decl_column : 75
    <938>   DW_AT_type        : <0x1c3>
    <93c>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><93f>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <940>   DW_AT_name        : (indirect string, offset: 0xa9856): vectorB
    <944>   DW_AT_decl_file   : 1
    <945>   DW_AT_decl_line   : 255
    <946>   DW_AT_decl_column : 103
    <947>   DW_AT_type        : <0x1c3>
    <94b>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><94e>: Abbrev Number: 27 (DW_TAG_variable)
    <94f>   DW_AT_name        : (indirect string, offset: 0x883de): result
    <953>   DW_AT_decl_file   : 1
    <954>   DW_AT_decl_line   : 256
    <956>   DW_AT_decl_column : 24
    <957>   DW_AT_type        : <0x1c3>
    <95b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><95e>: Abbrev Number: 0
 <1><95f>: Abbrev Number: 29 (DW_TAG_subprogram)
    <960>   DW_AT_name        : (indirect string, offset: 0x73854): FusionVectorSubtract
    <964>   DW_AT_decl_file   : 1
    <965>   DW_AT_decl_line   : 216
    <966>   DW_AT_decl_column : 28
    <967>   DW_AT_prototyped  : 1
    <967>   DW_AT_type        : <0x1b7>
    <96b>   DW_AT_low_pc      : 0x8000ffc
    <96f>   DW_AT_high_pc     : 0x9c
    <973>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <975>   DW_AT_GNU_all_call_sites: 1
    <975>   DW_AT_sibling     : <0x9a7>
 <2><979>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <97a>   DW_AT_name        : (indirect string, offset: 0xa984e): vectorA
    <97e>   DW_AT_decl_file   : 1
    <97f>   DW_AT_decl_line   : 216
    <980>   DW_AT_decl_column : 68
    <981>   DW_AT_type        : <0x1c3>
    <985>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><988>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <989>   DW_AT_name        : (indirect string, offset: 0xa9856): vectorB
    <98d>   DW_AT_decl_file   : 1
    <98e>   DW_AT_decl_line   : 216
    <98f>   DW_AT_decl_column : 96
    <990>   DW_AT_type        : <0x1c3>
    <994>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><997>: Abbrev Number: 23 (DW_TAG_variable)
    <998>   DW_AT_name        : (indirect string, offset: 0x883de): result
    <99c>   DW_AT_decl_file   : 1
    <99d>   DW_AT_decl_line   : 217
    <99e>   DW_AT_decl_column : 24
    <99f>   DW_AT_type        : <0x1c3>
    <9a3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 24 (DW_TAG_subprogram)
    <9a8>   DW_AT_name        : (indirect string, offset: 0xb32aa): FusionAsin
    <9ac>   DW_AT_decl_file   : 1
    <9ad>   DW_AT_decl_line   : 148
    <9ae>   DW_AT_decl_column : 21
    <9af>   DW_AT_prototyped  : 1
    <9af>   DW_AT_type        : <0x107>
    <9b3>   DW_AT_low_pc      : 0x8000fa4
    <9b7>   DW_AT_high_pc     : 0x58
    <9bb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9bd>   DW_AT_GNU_all_tail_call_sites: 1
    <9bd>   DW_AT_sibling     : <0x9d1>
 <2><9c1>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x112abd): value
    <9c6>   DW_AT_decl_file   : 1
    <9c7>   DW_AT_decl_line   : 148
    <9c8>   DW_AT_decl_column : 44
    <9c9>   DW_AT_type        : <0x10e>
    <9cd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9d0>: Abbrev Number: 0
 <1><9d1>: Abbrev Number: 30 (DW_TAG_subprogram)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x34b94): FusionRadiansToDegrees
    <9d6>   DW_AT_decl_file   : 1
    <9d7>   DW_AT_decl_line   : 136
    <9d8>   DW_AT_decl_column : 21
    <9d9>   DW_AT_prototyped  : 1
    <9d9>   DW_AT_type        : <0x107>
    <9dd>   DW_AT_low_pc      : 0x8000f7c
    <9e1>   DW_AT_high_pc     : 0x28
    <9e5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9e7>   DW_AT_GNU_all_call_sites: 1
 <2><9e7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x9fc96): radians
    <9ec>   DW_AT_decl_file   : 1
    <9ed>   DW_AT_decl_line   : 136
    <9ee>   DW_AT_decl_column : 56
    <9ef>   DW_AT_type        : <0x10e>
    <9f3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9f6>: Abbrev Number: 0
 <1><9f7>: Abbrev Number: 0
  Compilation Unit @ offset 0x9f8:
   Length:        0xe5a (32-bit)
   Version:       4
   Abbrev Offset: 0x210
   Pointer Size:  4
 <0><a03>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <a04>   DW_AT_producer    : (indirect string, offset: 0xd9556): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a08>   DW_AT_language    : 12	(ANSI C99)
    <a09>   DW_AT_name        : (indirect string, offset: 0x108948): ../Core/Src/Fusion/FusionAhrs.c
    <a0d>   DW_AT_comp_dir    : (indirect string, offset: 0x46da3): C:/Users/dkalaitzakis/STM32CubeIDE/workspace_1.12.1/stm32_devboard_RTOS/Debug
    <a11>   DW_AT_ranges      : 0x60
    <a15>   DW_AT_low_pc      : 0x0
    <a19>   DW_AT_stmt_list   : 0xca9
    <a1d>   DW_AT_GNU_macros  : 0x2984d
 <1><a21>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <a22>   DW_AT_encoding    : 7	(unsigned)
    <a23>   DW_AT_byte_size   : 1
    <a24>   DW_AT_type        : <0xa42>
    <a28>   DW_AT_decl_file   : 3
    <a29>   DW_AT_decl_line   : 16
    <a2a>   DW_AT_decl_column : 14
    <a2b>   DW_AT_sibling     : <0xa42>
 <2><a2f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0x105aae): FusionConventionNwu
    <a34>   DW_AT_const_value : 0
 <2><a35>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xdd0c6): FusionConventionEnu
    <a3a>   DW_AT_const_value : 1
 <2><a3b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xfbd21): FusionConventionNed
    <a40>   DW_AT_const_value : 2
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 4 (DW_TAG_base_type)
    <a43>   DW_AT_byte_size   : 1
    <a44>   DW_AT_encoding    : 8	(unsigned char)
    <a45>   DW_AT_name        : (indirect string, offset: 0xfe0c4): unsigned char
 <1><a49>: Abbrev Number: 5 (DW_TAG_typedef)
    <a4a>   DW_AT_name        : (indirect string, offset: 0xa9da9): FusionConvention
    <a4e>   DW_AT_decl_file   : 3
    <a4f>   DW_AT_decl_line   : 20
    <a50>   DW_AT_decl_column : 3
    <a51>   DW_AT_type        : <0xa21>
 <1><a55>: Abbrev Number: 6 (DW_TAG_const_type)
    <a56>   DW_AT_type        : <0xa49>
 <1><a5a>: Abbrev Number: 7 (DW_TAG_base_type)
    <a5b>   DW_AT_byte_size   : 4
    <a5c>   DW_AT_encoding    : 5	(signed)
    <a5d>   DW_AT_name        : int
 <1><a61>: Abbrev Number: 4 (DW_TAG_base_type)
    <a62>   DW_AT_byte_size   : 4
    <a63>   DW_AT_encoding    : 7	(unsigned)
    <a64>   DW_AT_name        : (indirect string, offset: 0x15906): unsigned int
 <1><a68>: Abbrev Number: 6 (DW_TAG_const_type)
    <a69>   DW_AT_type        : <0xa61>
 <1><a6d>: Abbrev Number: 4 (DW_TAG_base_type)
    <a6e>   DW_AT_byte_size   : 8
    <a6f>   DW_AT_encoding    : 5	(signed)
    <a70>   DW_AT_name        : (indirect string, offset: 0x77ec6): long long int
 <1><a74>: Abbrev Number: 4 (DW_TAG_base_type)
    <a75>   DW_AT_byte_size   : 8
    <a76>   DW_AT_encoding    : 4	(float)
    <a77>   DW_AT_name        : (indirect string, offset: 0x182bb): long double
 <1><a7b>: Abbrev Number: 4 (DW_TAG_base_type)
    <a7c>   DW_AT_byte_size   : 1
    <a7d>   DW_AT_encoding    : 6	(signed char)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x841bd): signed char
 <1><a82>: Abbrev Number: 4 (DW_TAG_base_type)
    <a83>   DW_AT_byte_size   : 2
    <a84>   DW_AT_encoding    : 5	(signed)
    <a85>   DW_AT_name        : (indirect string, offset: 0xc40ba): short int
 <1><a89>: Abbrev Number: 4 (DW_TAG_base_type)
    <a8a>   DW_AT_byte_size   : 2
    <a8b>   DW_AT_encoding    : 7	(unsigned)
    <a8c>   DW_AT_name        : (indirect string, offset: 0xfc3da): short unsigned int
 <1><a90>: Abbrev Number: 5 (DW_TAG_typedef)
    <a91>   DW_AT_name        : (indirect string, offset: 0x1088ed): __int32_t
    <a95>   DW_AT_decl_file   : 4
    <a96>   DW_AT_decl_line   : 77
    <a97>   DW_AT_decl_column : 24
    <a98>   DW_AT_type        : <0xa9c>
 <1><a9c>: Abbrev Number: 4 (DW_TAG_base_type)
    <a9d>   DW_AT_byte_size   : 4
    <a9e>   DW_AT_encoding    : 5	(signed)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x164dd): long int
 <1><aa3>: Abbrev Number: 4 (DW_TAG_base_type)
    <aa4>   DW_AT_byte_size   : 4
    <aa5>   DW_AT_encoding    : 7	(unsigned)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x63f03): long unsigned int
 <1><aaa>: Abbrev Number: 4 (DW_TAG_base_type)
    <aab>   DW_AT_byte_size   : 8
    <aac>   DW_AT_encoding    : 7	(unsigned)
    <aad>   DW_AT_name        : (indirect string, offset: 0x36426): long long unsigned int
 <1><ab1>: Abbrev Number: 4 (DW_TAG_base_type)
    <ab2>   DW_AT_byte_size   : 1
    <ab3>   DW_AT_encoding    : 8	(unsigned char)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x10db0a): char
 <1><ab8>: Abbrev Number: 4 (DW_TAG_base_type)
    <ab9>   DW_AT_byte_size   : 4
    <aba>   DW_AT_encoding    : 4	(float)
    <abb>   DW_AT_name        : (indirect string, offset: 0x10b1ee): float
 <1><abf>: Abbrev Number: 6 (DW_TAG_const_type)
    <ac0>   DW_AT_type        : <0xab8>
 <1><ac4>: Abbrev Number: 4 (DW_TAG_base_type)
    <ac5>   DW_AT_byte_size   : 8
    <ac6>   DW_AT_encoding    : 4	(float)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x10d117): double
 <1><acb>: Abbrev Number: 5 (DW_TAG_typedef)
    <acc>   DW_AT_name        : (indirect string, offset: 0x1088ef): int32_t
    <ad0>   DW_AT_decl_file   : 5
    <ad1>   DW_AT_decl_line   : 44
    <ad2>   DW_AT_decl_column : 19
    <ad3>   DW_AT_type        : <0xa90>
 <1><ad7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ad8>   DW_AT_byte_size   : 12
    <ad9>   DW_AT_decl_file   : 1
    <ada>   DW_AT_decl_line   : 26
    <adb>   DW_AT_decl_column : 5
    <adc>   DW_AT_sibling     : <0xb02>
 <2><ae0>: Abbrev Number: 9 (DW_TAG_member)
    <ae1>   DW_AT_name        : x
    <ae3>   DW_AT_decl_file   : 1
    <ae4>   DW_AT_decl_line   : 27
    <ae5>   DW_AT_decl_column : 15
    <ae6>   DW_AT_type        : <0xab8>
    <aea>   DW_AT_data_member_location: 0
 <2><aeb>: Abbrev Number: 9 (DW_TAG_member)
    <aec>   DW_AT_name        : y
    <aee>   DW_AT_decl_file   : 1
    <aef>   DW_AT_decl_line   : 28
    <af0>   DW_AT_decl_column : 15
    <af1>   DW_AT_type        : <0xab8>
    <af5>   DW_AT_data_member_location: 4
 <2><af6>: Abbrev Number: 9 (DW_TAG_member)
    <af7>   DW_AT_name        : z
    <af9>   DW_AT_decl_file   : 1
    <afa>   DW_AT_decl_line   : 29
    <afb>   DW_AT_decl_column : 15
    <afc>   DW_AT_type        : <0xab8>
    <b00>   DW_AT_data_member_location: 8
 <2><b01>: Abbrev Number: 0
 <1><b02>: Abbrev Number: 10 (DW_TAG_union_type)
    <b03>   DW_AT_byte_size   : 12
    <b04>   DW_AT_decl_file   : 1
    <b05>   DW_AT_decl_line   : 23
    <b06>   DW_AT_decl_column : 9
    <b07>   DW_AT_sibling     : <0xb24>
 <2><b0b>: Abbrev Number: 11 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x116fb9): array
    <b10>   DW_AT_decl_file   : 1
    <b11>   DW_AT_decl_line   : 24
    <b12>   DW_AT_decl_column : 11
    <b13>   DW_AT_type        : <0xb24>
 <2><b17>: Abbrev Number: 11 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0xaac8a): axis
    <b1c>   DW_AT_decl_file   : 1
    <b1d>   DW_AT_decl_line   : 30
    <b1e>   DW_AT_decl_column : 7
    <b1f>   DW_AT_type        : <0xad7>
 <2><b23>: Abbrev Number: 0
 <1><b24>: Abbrev Number: 12 (DW_TAG_array_type)
    <b25>   DW_AT_type        : <0xab8>
    <b29>   DW_AT_sibling     : <0xb34>
 <2><b2d>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b2e>   DW_AT_type        : <0xa61>
    <b32>   DW_AT_upper_bound : 2
 <2><b33>: Abbrev Number: 0
 <1><b34>: Abbrev Number: 5 (DW_TAG_typedef)
    <b35>   DW_AT_name        : (indirect string, offset: 0x9add7): FusionVector
    <b39>   DW_AT_decl_file   : 1
    <b3a>   DW_AT_decl_line   : 31
    <b3b>   DW_AT_decl_column : 3
    <b3c>   DW_AT_type        : <0xb02>
 <1><b40>: Abbrev Number: 6 (DW_TAG_const_type)
    <b41>   DW_AT_type        : <0xb34>
 <1><b45>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b46>   DW_AT_byte_size   : 16
    <b47>   DW_AT_decl_file   : 1
    <b48>   DW_AT_decl_line   : 39
    <b49>   DW_AT_decl_column : 5
    <b4a>   DW_AT_sibling     : <0xb7b>
 <2><b4e>: Abbrev Number: 9 (DW_TAG_member)
    <b4f>   DW_AT_name        : w
    <b51>   DW_AT_decl_file   : 1
    <b52>   DW_AT_decl_line   : 40
    <b53>   DW_AT_decl_column : 15
    <b54>   DW_AT_type        : <0xab8>
    <b58>   DW_AT_data_member_location: 0
 <2><b59>: Abbrev Number: 9 (DW_TAG_member)
    <b5a>   DW_AT_name        : x
    <b5c>   DW_AT_decl_file   : 1
    <b5d>   DW_AT_decl_line   : 41
    <b5e>   DW_AT_decl_column : 15
    <b5f>   DW_AT_type        : <0xab8>
    <b63>   DW_AT_data_member_location: 4
 <2><b64>: Abbrev Number: 9 (DW_TAG_member)
    <b65>   DW_AT_name        : y
    <b67>   DW_AT_decl_file   : 1
    <b68>   DW_AT_decl_line   : 42
    <b69>   DW_AT_decl_column : 15
    <b6a>   DW_AT_type        : <0xab8>
    <b6e>   DW_AT_data_member_location: 8
 <2><b6f>: Abbrev Number: 9 (DW_TAG_member)
    <b70>   DW_AT_name        : z
    <b72>   DW_AT_decl_file   : 1
    <b73>   DW_AT_decl_line   : 43
    <b74>   DW_AT_decl_column : 15
    <b75>   DW_AT_type        : <0xab8>
    <b79>   DW_AT_data_member_location: 12
 <2><b7a>: Abbrev Number: 0
 <1><b7b>: Abbrev Number: 10 (DW_TAG_union_type)
    <b7c>   DW_AT_byte_size   : 16
    <b7d>   DW_AT_decl_file   : 1
    <b7e>   DW_AT_decl_line   : 36
    <b7f>   DW_AT_decl_column : 9
    <b80>   DW_AT_sibling     : <0xb9d>
 <2><b84>: Abbrev Number: 11 (DW_TAG_member)
    <b85>   DW_AT_name        : (indirect string, offset: 0x116fb9): array
    <b89>   DW_AT_decl_file   : 1
    <b8a>   DW_AT_decl_line   : 37
    <b8b>   DW_AT_decl_column : 11
    <b8c>   DW_AT_type        : <0xb9d>
 <2><b90>: Abbrev Number: 11 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0x1020d0): element
    <b95>   DW_AT_decl_file   : 1
    <b96>   DW_AT_decl_line   : 44
    <b97>   DW_AT_decl_column : 7
    <b98>   DW_AT_type        : <0xb45>
 <2><b9c>: Abbrev Number: 0
 <1><b9d>: Abbrev Number: 12 (DW_TAG_array_type)
    <b9e>   DW_AT_type        : <0xab8>
    <ba2>   DW_AT_sibling     : <0xbad>
 <2><ba6>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ba7>   DW_AT_type        : <0xa61>
    <bab>   DW_AT_upper_bound : 3
 <2><bac>: Abbrev Number: 0
 <1><bad>: Abbrev Number: 5 (DW_TAG_typedef)
    <bae>   DW_AT_name        : (indirect string, offset: 0x92bc5): FusionQuaternion
    <bb2>   DW_AT_decl_file   : 1
    <bb3>   DW_AT_decl_line   : 45
    <bb4>   DW_AT_decl_column : 3
    <bb5>   DW_AT_type        : <0xb7b>
 <1><bb9>: Abbrev Number: 6 (DW_TAG_const_type)
    <bba>   DW_AT_type        : <0xbad>
 <1><bbe>: Abbrev Number: 8 (DW_TAG_structure_type)
    <bbf>   DW_AT_byte_size   : 20
    <bc0>   DW_AT_decl_file   : 6
    <bc1>   DW_AT_decl_line   : 24
    <bc2>   DW_AT_decl_column : 9
    <bc3>   DW_AT_sibling     : <0xc09>
 <2><bc7>: Abbrev Number: 14 (DW_TAG_member)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x28309): convention
    <bcc>   DW_AT_decl_file   : 6
    <bcd>   DW_AT_decl_line   : 25
    <bce>   DW_AT_decl_column : 22
    <bcf>   DW_AT_type        : <0xa49>
    <bd3>   DW_AT_data_member_location: 0
 <2><bd4>: Abbrev Number: 14 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x106b74): gain
    <bd9>   DW_AT_decl_file   : 6
    <bda>   DW_AT_decl_line   : 26
    <bdb>   DW_AT_decl_column : 11
    <bdc>   DW_AT_type        : <0xab8>
    <be0>   DW_AT_data_member_location: 4
 <2><be1>: Abbrev Number: 14 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x34742): accelerationRejection
    <be6>   DW_AT_decl_file   : 6
    <be7>   DW_AT_decl_line   : 27
    <be8>   DW_AT_decl_column : 11
    <be9>   DW_AT_type        : <0xab8>
    <bed>   DW_AT_data_member_location: 8
 <2><bee>: Abbrev Number: 14 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0x2cdb): magneticRejection
    <bf3>   DW_AT_decl_file   : 6
    <bf4>   DW_AT_decl_line   : 28
    <bf5>   DW_AT_decl_column : 11
    <bf6>   DW_AT_type        : <0xab8>
    <bfa>   DW_AT_data_member_location: 12
 <2><bfb>: Abbrev Number: 14 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x34e7f): rejectionTimeout
    <c00>   DW_AT_decl_file   : 6
    <c01>   DW_AT_decl_line   : 29
    <c02>   DW_AT_decl_column : 18
    <c03>   DW_AT_type        : <0xa61>
    <c07>   DW_AT_data_member_location: 16
 <2><c08>: Abbrev Number: 0
 <1><c09>: Abbrev Number: 5 (DW_TAG_typedef)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xbfa9f): FusionAhrsSettings
    <c0e>   DW_AT_decl_file   : 6
    <c0f>   DW_AT_decl_line   : 30
    <c10>   DW_AT_decl_column : 3
    <c11>   DW_AT_type        : <0xbbe>
 <1><c15>: Abbrev Number: 6 (DW_TAG_const_type)
    <c16>   DW_AT_type        : <0xc09>
 <1><c1a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c1b>   DW_AT_byte_size   : 104
    <c1c>   DW_AT_decl_file   : 6
    <c1d>   DW_AT_decl_line   : 36
    <c1e>   DW_AT_decl_column : 9
    <c1f>   DW_AT_sibling     : <0xcda>
 <2><c23>: Abbrev Number: 14 (DW_TAG_member)
    <c24>   DW_AT_name        : (indirect string, offset: 0x5a5d7): settings
    <c28>   DW_AT_decl_file   : 6
    <c29>   DW_AT_decl_line   : 37
    <c2a>   DW_AT_decl_column : 24
    <c2b>   DW_AT_type        : <0xc09>
    <c2f>   DW_AT_data_member_location: 0
 <2><c30>: Abbrev Number: 14 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0x28dc6): quaternion
    <c35>   DW_AT_decl_file   : 6
    <c36>   DW_AT_decl_line   : 38
    <c37>   DW_AT_decl_column : 22
    <c38>   DW_AT_type        : <0xbad>
    <c3c>   DW_AT_data_member_location: 20
 <2><c3d>: Abbrev Number: 14 (DW_TAG_member)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xb668e): accelerometer
    <c42>   DW_AT_decl_file   : 6
    <c43>   DW_AT_decl_line   : 39
    <c44>   DW_AT_decl_column : 18
    <c45>   DW_AT_type        : <0xb34>
    <c49>   DW_AT_data_member_location: 36
 <2><c4a>: Abbrev Number: 14 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0xb8811): initialising
    <c4f>   DW_AT_decl_file   : 6
    <c50>   DW_AT_decl_line   : 40
    <c51>   DW_AT_decl_column : 10
    <c52>   DW_AT_type        : <0xcda>
    <c56>   DW_AT_data_member_location: 48
 <2><c57>: Abbrev Number: 14 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0xe919e): rampedGain
    <c5c>   DW_AT_decl_file   : 6
    <c5d>   DW_AT_decl_line   : 41
    <c5e>   DW_AT_decl_column : 11
    <c5f>   DW_AT_type        : <0xab8>
    <c63>   DW_AT_data_member_location: 52
 <2><c64>: Abbrev Number: 14 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x2c457): rampedGainStep
    <c69>   DW_AT_decl_file   : 6
    <c6a>   DW_AT_decl_line   : 42
    <c6b>   DW_AT_decl_column : 11
    <c6c>   DW_AT_type        : <0xab8>
    <c70>   DW_AT_data_member_location: 56
 <2><c71>: Abbrev Number: 14 (DW_TAG_member)
    <c72>   DW_AT_name        : (indirect string, offset: 0x8ca62): halfAccelerometerFeedback
    <c76>   DW_AT_decl_file   : 6
    <c77>   DW_AT_decl_line   : 43
    <c78>   DW_AT_decl_column : 18
    <c79>   DW_AT_type        : <0xb34>
    <c7d>   DW_AT_data_member_location: 60
 <2><c7e>: Abbrev Number: 14 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x9af2f): halfMagnetometerFeedback
    <c83>   DW_AT_decl_file   : 6
    <c84>   DW_AT_decl_line   : 44
    <c85>   DW_AT_decl_column : 18
    <c86>   DW_AT_type        : <0xb34>
    <c8a>   DW_AT_data_member_location: 72
 <2><c8b>: Abbrev Number: 14 (DW_TAG_member)
    <c8c>   DW_AT_name        : (indirect string, offset: 0xac1ce): accelerometerIgnored
    <c90>   DW_AT_decl_file   : 6
    <c91>   DW_AT_decl_line   : 45
    <c92>   DW_AT_decl_column : 10
    <c93>   DW_AT_type        : <0xcda>
    <c97>   DW_AT_data_member_location: 84
 <2><c98>: Abbrev Number: 14 (DW_TAG_member)
    <c99>   DW_AT_name        : (indirect string, offset: 0xe6e3d): accelerationRejectionTimer
    <c9d>   DW_AT_decl_file   : 6
    <c9e>   DW_AT_decl_line   : 46
    <c9f>   DW_AT_decl_column : 18
    <ca0>   DW_AT_type        : <0xa61>
    <ca4>   DW_AT_data_member_location: 88
 <2><ca5>: Abbrev Number: 14 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xf21b9): accelerationRejectionTimeout
    <caa>   DW_AT_decl_file   : 6
    <cab>   DW_AT_decl_line   : 47
    <cac>   DW_AT_decl_column : 10
    <cad>   DW_AT_type        : <0xcda>
    <cb1>   DW_AT_data_member_location: 92
 <2><cb2>: Abbrev Number: 14 (DW_TAG_member)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x46163): magnetometerIgnored
    <cb7>   DW_AT_decl_file   : 6
    <cb8>   DW_AT_decl_line   : 48
    <cb9>   DW_AT_decl_column : 10
    <cba>   DW_AT_type        : <0xcda>
    <cbe>   DW_AT_data_member_location: 93
 <2><cbf>: Abbrev Number: 14 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x4336d): magneticRejectionTimer
    <cc4>   DW_AT_decl_file   : 6
    <cc5>   DW_AT_decl_line   : 49
    <cc6>   DW_AT_decl_column : 18
    <cc7>   DW_AT_type        : <0xa61>
    <ccb>   DW_AT_data_member_location: 96
 <2><ccc>: Abbrev Number: 14 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x43caf): magneticRejectionTimeout
    <cd1>   DW_AT_decl_file   : 6
    <cd2>   DW_AT_decl_line   : 50
    <cd3>   DW_AT_decl_column : 10
    <cd4>   DW_AT_type        : <0xcda>
    <cd8>   DW_AT_data_member_location: 100
 <2><cd9>: Abbrev Number: 0
 <1><cda>: Abbrev Number: 4 (DW_TAG_base_type)
    <cdb>   DW_AT_byte_size   : 1
    <cdc>   DW_AT_encoding    : 2	(boolean)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x69bfc): _Bool
 <1><ce1>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce2>   DW_AT_name        : (indirect string, offset: 0xe1ef2): FusionAhrs
    <ce6>   DW_AT_decl_file   : 6
    <ce7>   DW_AT_decl_line   : 51
    <ce8>   DW_AT_decl_column : 3
    <ce9>   DW_AT_type        : <0xc1a>
 <1><ced>: Abbrev Number: 6 (DW_TAG_const_type)
    <cee>   DW_AT_type        : <0xce1>
 <1><cf2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <cf3>   DW_AT_byte_size   : 24
    <cf4>   DW_AT_decl_file   : 6
    <cf5>   DW_AT_decl_line   : 56
    <cf6>   DW_AT_decl_column : 9
    <cf7>   DW_AT_sibling     : <0xd4a>
 <2><cfb>: Abbrev Number: 14 (DW_TAG_member)
    <cfc>   DW_AT_name        : (indirect string, offset: 0x107f72): accelerationError
    <d00>   DW_AT_decl_file   : 6
    <d01>   DW_AT_decl_line   : 57
    <d02>   DW_AT_decl_column : 11
    <d03>   DW_AT_type        : <0xab8>
    <d07>   DW_AT_data_member_location: 0
 <2><d08>: Abbrev Number: 14 (DW_TAG_member)
    <d09>   DW_AT_name        : (indirect string, offset: 0xac1ce): accelerometerIgnored
    <d0d>   DW_AT_decl_file   : 6
    <d0e>   DW_AT_decl_line   : 58
    <d0f>   DW_AT_decl_column : 10
    <d10>   DW_AT_type        : <0xcda>
    <d14>   DW_AT_data_member_location: 4
 <2><d15>: Abbrev Number: 14 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0xe6e3d): accelerationRejectionTimer
    <d1a>   DW_AT_decl_file   : 6
    <d1b>   DW_AT_decl_line   : 59
    <d1c>   DW_AT_decl_column : 11
    <d1d>   DW_AT_type        : <0xab8>
    <d21>   DW_AT_data_member_location: 8
 <2><d22>: Abbrev Number: 14 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0x1088b4): magneticError
    <d27>   DW_AT_decl_file   : 6
    <d28>   DW_AT_decl_line   : 60
    <d29>   DW_AT_decl_column : 11
    <d2a>   DW_AT_type        : <0xab8>
    <d2e>   DW_AT_data_member_location: 12
 <2><d2f>: Abbrev Number: 14 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x46163): magnetometerIgnored
    <d34>   DW_AT_decl_file   : 6
    <d35>   DW_AT_decl_line   : 61
    <d36>   DW_AT_decl_column : 10
    <d37>   DW_AT_type        : <0xcda>
    <d3b>   DW_AT_data_member_location: 16
 <2><d3c>: Abbrev Number: 14 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x4336d): magneticRejectionTimer
    <d41>   DW_AT_decl_file   : 6
    <d42>   DW_AT_decl_line   : 62
    <d43>   DW_AT_decl_column : 11
    <d44>   DW_AT_type        : <0xab8>
    <d48>   DW_AT_data_member_location: 20
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 5 (DW_TAG_typedef)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x108419): FusionAhrsInternalStates
    <d4f>   DW_AT_decl_file   : 6
    <d50>   DW_AT_decl_line   : 63
    <d51>   DW_AT_decl_column : 3
    <d52>   DW_AT_type        : <0xcf2>
 <1><d56>: Abbrev Number: 6 (DW_TAG_const_type)
    <d57>   DW_AT_type        : <0xd4a>
 <1><d5b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d5c>   DW_AT_byte_size   : 5
    <d5d>   DW_AT_decl_file   : 6
    <d5e>   DW_AT_decl_line   : 68
    <d5f>   DW_AT_decl_column : 9
    <d60>   DW_AT_sibling     : <0xda6>
 <2><d64>: Abbrev Number: 14 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0xb8811): initialising
    <d69>   DW_AT_decl_file   : 6
    <d6a>   DW_AT_decl_line   : 69
    <d6b>   DW_AT_decl_column : 10
    <d6c>   DW_AT_type        : <0xcda>
    <d70>   DW_AT_data_member_location: 0
 <2><d71>: Abbrev Number: 14 (DW_TAG_member)
    <d72>   DW_AT_name        : (indirect string, offset: 0x1081f3): accelerationRejectionWarning
    <d76>   DW_AT_decl_file   : 6
    <d77>   DW_AT_decl_line   : 70
    <d78>   DW_AT_decl_column : 10
    <d79>   DW_AT_type        : <0xcda>
    <d7d>   DW_AT_data_member_location: 1
 <2><d7e>: Abbrev Number: 14 (DW_TAG_member)
    <d7f>   DW_AT_name        : (indirect string, offset: 0xf21b9): accelerationRejectionTimeout
    <d83>   DW_AT_decl_file   : 6
    <d84>   DW_AT_decl_line   : 71
    <d85>   DW_AT_decl_column : 10
    <d86>   DW_AT_type        : <0xcda>
    <d8a>   DW_AT_data_member_location: 2
 <2><d8b>: Abbrev Number: 14 (DW_TAG_member)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x108327): magneticRejectionWarning
    <d90>   DW_AT_decl_file   : 6
    <d91>   DW_AT_decl_line   : 72
    <d92>   DW_AT_decl_column : 10
    <d93>   DW_AT_type        : <0xcda>
    <d97>   DW_AT_data_member_location: 3
 <2><d98>: Abbrev Number: 14 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0x43caf): magneticRejectionTimeout
    <d9d>   DW_AT_decl_file   : 6
    <d9e>   DW_AT_decl_line   : 73
    <d9f>   DW_AT_decl_column : 10
    <da0>   DW_AT_type        : <0xcda>
    <da4>   DW_AT_data_member_location: 4
 <2><da5>: Abbrev Number: 0
 <1><da6>: Abbrev Number: 5 (DW_TAG_typedef)
    <da7>   DW_AT_name        : (indirect string, offset: 0x1088d0): FusionAhrsFlags
    <dab>   DW_AT_decl_file   : 6
    <dac>   DW_AT_decl_line   : 74
    <dad>   DW_AT_decl_column : 3
    <dae>   DW_AT_type        : <0xd5b>
 <1><db2>: Abbrev Number: 6 (DW_TAG_const_type)
    <db3>   DW_AT_type        : <0xda6>
 <1><db7>: Abbrev Number: 15 (DW_TAG_subprogram)
    <db8>   DW_AT_external    : 1
    <db8>   DW_AT_name        : (indirect string, offset: 0x30c6c): asinf
    <dbc>   DW_AT_decl_file   : 7
    <dbd>   DW_AT_decl_line   : 367
    <dbf>   DW_AT_decl_column : 14
    <dc0>   DW_AT_prototyped  : 1
    <dc0>   DW_AT_type        : <0xab8>
    <dc4>   DW_AT_declaration : 1
    <dc4>   DW_AT_sibling     : <0xdce>
 <2><dc8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <dc9>   DW_AT_type        : <0xab8>
 <2><dcd>: Abbrev Number: 0
 <1><dce>: Abbrev Number: 15 (DW_TAG_subprogram)
    <dcf>   DW_AT_external    : 1
    <dcf>   DW_AT_name        : (indirect string, offset: 0x108968): sqrtf
    <dd3>   DW_AT_decl_file   : 7
    <dd4>   DW_AT_decl_line   : 376
    <dd6>   DW_AT_decl_column : 14
    <dd7>   DW_AT_prototyped  : 1
    <dd7>   DW_AT_type        : <0xab8>
    <ddb>   DW_AT_declaration : 1
    <ddb>   DW_AT_sibling     : <0xde5>
 <2><ddf>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <de0>   DW_AT_type        : <0xab8>
 <2><de4>: Abbrev Number: 0
 <1><de5>: Abbrev Number: 15 (DW_TAG_subprogram)
    <de6>   DW_AT_external    : 1
    <de6>   DW_AT_name        : (indirect string, offset: 0x1081ee): cosf
    <dea>   DW_AT_decl_file   : 7
    <deb>   DW_AT_decl_line   : 355
    <ded>   DW_AT_decl_column : 14
    <dee>   DW_AT_prototyped  : 1
    <dee>   DW_AT_type        : <0xab8>
    <df2>   DW_AT_declaration : 1
    <df2>   DW_AT_sibling     : <0xdfc>
 <2><df6>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <df7>   DW_AT_type        : <0xab8>
 <2><dfb>: Abbrev Number: 0
 <1><dfc>: Abbrev Number: 15 (DW_TAG_subprogram)
    <dfd>   DW_AT_external    : 1
    <dfd>   DW_AT_name        : (indirect string, offset: 0x82f9a): atan2f
    <e01>   DW_AT_decl_file   : 7
    <e02>   DW_AT_decl_line   : 368
    <e04>   DW_AT_decl_column : 14
    <e05>   DW_AT_prototyped  : 1
    <e05>   DW_AT_type        : <0xab8>
    <e09>   DW_AT_declaration : 1
    <e09>   DW_AT_sibling     : <0xe18>
 <2><e0d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e0e>   DW_AT_type        : <0xab8>
 <2><e12>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e13>   DW_AT_type        : <0xab8>
 <2><e17>: Abbrev Number: 0
 <1><e18>: Abbrev Number: 17 (DW_TAG_subprogram)
    <e19>   DW_AT_external    : 1
    <e19>   DW_AT_name        : (indirect string, offset: 0x107f84): FusionCompassCalculateHeading
    <e1d>   DW_AT_decl_file   : 8
    <e1e>   DW_AT_decl_line   : 20
    <e1f>   DW_AT_decl_column : 7
    <e20>   DW_AT_prototyped  : 1
    <e20>   DW_AT_type        : <0xab8>
    <e24>   DW_AT_declaration : 1
    <e24>   DW_AT_sibling     : <0xe38>
 <2><e28>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e29>   DW_AT_type        : <0xa55>
 <2><e2d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e2e>   DW_AT_type        : <0xb40>
 <2><e32>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e33>   DW_AT_type        : <0xb40>
 <2><e37>: Abbrev Number: 0
 <1><e38>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e39>   DW_AT_external    : 1
    <e39>   DW_AT_name        : (indirect string, offset: 0x10892d): powf
    <e3d>   DW_AT_decl_file   : 7
    <e3e>   DW_AT_decl_line   : 375
    <e40>   DW_AT_decl_column : 14
    <e41>   DW_AT_prototyped  : 1
    <e41>   DW_AT_type        : <0xab8>
    <e45>   DW_AT_declaration : 1
    <e45>   DW_AT_sibling     : <0xe54>
 <2><e49>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e4a>   DW_AT_type        : <0xab8>
 <2><e4e>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e4f>   DW_AT_type        : <0xab8>
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e55>   DW_AT_external    : 1
    <e55>   DW_AT_name        : (indirect string, offset: 0x30c6d): sinf
    <e59>   DW_AT_decl_file   : 7
    <e5a>   DW_AT_decl_line   : 356
    <e5c>   DW_AT_decl_column : 14
    <e5d>   DW_AT_prototyped  : 1
    <e5d>   DW_AT_type        : <0xab8>
    <e61>   DW_AT_declaration : 1
    <e61>   DW_AT_sibling     : <0xe6b>
 <2><e65>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e66>   DW_AT_type        : <0xab8>
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 18 (DW_TAG_subprogram)
    <e6c>   DW_AT_external    : 1
    <e6c>   DW_AT_name        : (indirect string, offset: 0x108480): FusionAhrsSetHeading
    <e70>   DW_AT_decl_file   : 2
    <e71>   DW_AT_decl_line   : 432
    <e73>   DW_AT_decl_column : 6
    <e74>   DW_AT_prototyped  : 1
    <e74>   DW_AT_low_pc      : 0x8002eea
    <e78>   DW_AT_high_pc     : 0x12c
    <e7c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e7e>   DW_AT_GNU_all_tail_call_sites: 1
    <e7e>   DW_AT_sibling     : <0xed3>
 <2><e82>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e83>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <e87>   DW_AT_decl_file   : 2
    <e88>   DW_AT_decl_line   : 432
    <e8a>   DW_AT_decl_column : 45
    <e8b>   DW_AT_type        : <0xed9>
    <e8f>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><e92>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e93>   DW_AT_name        : (indirect string, offset: 0x1086b7): heading
    <e97>   DW_AT_decl_file   : 2
    <e98>   DW_AT_decl_line   : 432
    <e9a>   DW_AT_decl_column : 63
    <e9b>   DW_AT_type        : <0xabf>
    <e9f>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><ea2>: Abbrev Number: 20 (DW_TAG_variable)
    <ea3>   DW_AT_name        : yaw
    <ea7>   DW_AT_decl_file   : 2
    <ea8>   DW_AT_decl_line   : 434
    <eaa>   DW_AT_decl_column : 17
    <eab>   DW_AT_type        : <0xabf>
    <eaf>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><eb2>: Abbrev Number: 21 (DW_TAG_variable)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x108174): halfYawMinusHeading
    <eb7>   DW_AT_decl_file   : 2
    <eb8>   DW_AT_decl_line   : 435
    <eba>   DW_AT_decl_column : 17
    <ebb>   DW_AT_type        : <0xabf>
    <ebf>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><ec2>: Abbrev Number: 21 (DW_TAG_variable)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x10868b): rotation
    <ec7>   DW_AT_decl_file   : 2
    <ec8>   DW_AT_decl_line   : 436
    <eca>   DW_AT_decl_column : 28
    <ecb>   DW_AT_type        : <0xbb9>
    <ecf>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><ed2>: Abbrev Number: 0
 <1><ed3>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <ed4>   DW_AT_byte_size   : 4
    <ed5>   DW_AT_type        : <0xce1>
 <1><ed9>: Abbrev Number: 6 (DW_TAG_const_type)
    <eda>   DW_AT_type        : <0xed3>
 <1><ede>: Abbrev Number: 23 (DW_TAG_subprogram)
    <edf>   DW_AT_external    : 1
    <edf>   DW_AT_name        : (indirect string, offset: 0x10896e): FusionAhrsGetFlags
    <ee3>   DW_AT_decl_file   : 2
    <ee4>   DW_AT_decl_line   : 413
    <ee6>   DW_AT_decl_column : 17
    <ee7>   DW_AT_prototyped  : 1
    <ee7>   DW_AT_type        : <0xda6>
    <eeb>   DW_AT_low_pc      : 0x0
    <eef>   DW_AT_high_pc     : 0x6a
    <ef3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ef5>   DW_AT_GNU_all_call_sites: 1
    <ef5>   DW_AT_sibling     : <0xf2a>
 <2><ef9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <efa>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <efe>   DW_AT_decl_file   : 2
    <eff>   DW_AT_decl_line   : 413
    <f01>   DW_AT_decl_column : 60
    <f02>   DW_AT_type        : <0xf30>
    <f06>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><f09>: Abbrev Number: 21 (DW_TAG_variable)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x108471): warningTimeout
    <f0e>   DW_AT_decl_file   : 2
    <f0f>   DW_AT_decl_line   : 414
    <f11>   DW_AT_decl_column : 24
    <f12>   DW_AT_type        : <0xa68>
    <f16>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f19>: Abbrev Number: 21 (DW_TAG_variable)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x1166ef): flags
    <f1e>   DW_AT_decl_file   : 2
    <f1f>   DW_AT_decl_line   : 415
    <f21>   DW_AT_decl_column : 27
    <f22>   DW_AT_type        : <0xdb2>
    <f26>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f29>: Abbrev Number: 0
 <1><f2a>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <f2b>   DW_AT_byte_size   : 4
    <f2c>   DW_AT_type        : <0xced>
 <1><f30>: Abbrev Number: 6 (DW_TAG_const_type)
    <f31>   DW_AT_type        : <0xf2a>
 <1><f35>: Abbrev Number: 24 (DW_TAG_subprogram)
    <f36>   DW_AT_external    : 1
    <f36>   DW_AT_name        : (indirect string, offset: 0x1081b2): FusionAhrsGetInternalStates
    <f3a>   DW_AT_decl_file   : 2
    <f3b>   DW_AT_decl_line   : 396
    <f3d>   DW_AT_decl_column : 26
    <f3e>   DW_AT_prototyped  : 1
    <f3e>   DW_AT_type        : <0xd4a>
    <f42>   DW_AT_low_pc      : 0x0
    <f46>   DW_AT_high_pc     : 0x11c
    <f4a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4c>   DW_AT_GNU_all_tail_call_sites: 1
    <f4c>   DW_AT_sibling     : <0xf71>
 <2><f50>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f51>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <f55>   DW_AT_decl_file   : 2
    <f56>   DW_AT_decl_line   : 396
    <f58>   DW_AT_decl_column : 78
    <f59>   DW_AT_type        : <0xf30>
    <f5d>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><f60>: Abbrev Number: 21 (DW_TAG_variable)
    <f61>   DW_AT_name        : (indirect string, offset: 0x1087a8): internalStates
    <f65>   DW_AT_decl_file   : 2
    <f66>   DW_AT_decl_line   : 397
    <f68>   DW_AT_decl_column : 36
    <f69>   DW_AT_type        : <0xd56>
    <f6d>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><f70>: Abbrev Number: 0
 <1><f71>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f72>   DW_AT_external    : 1
    <f72>   DW_AT_name        : (indirect string, offset: 0x107faa): FusionAhrsGetEarthAcceleration
    <f76>   DW_AT_decl_file   : 2
    <f77>   DW_AT_decl_line   : 358
    <f79>   DW_AT_decl_column : 14
    <f7a>   DW_AT_prototyped  : 1
    <f7a>   DW_AT_type        : <0xb34>
    <f7e>   DW_AT_low_pc      : 0x0
    <f82>   DW_AT_high_pc     : 0x234
    <f86>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f88>   DW_AT_GNU_all_call_sites: 1
    <f88>   DW_AT_sibling     : <0x101e>
 <2><f8c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <f91>   DW_AT_decl_file   : 2
    <f92>   DW_AT_decl_line   : 358
    <f94>   DW_AT_decl_column : 69
    <f95>   DW_AT_type        : <0xf30>
    <f99>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><f9d>: Abbrev Number: 21 (DW_TAG_variable)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x108145): qwqw
    <fa2>   DW_AT_decl_file   : 2
    <fa3>   DW_AT_decl_line   : 363
    <fa5>   DW_AT_decl_column : 17
    <fa6>   DW_AT_type        : <0xabf>
    <faa>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fad>: Abbrev Number: 21 (DW_TAG_variable)
    <fae>   DW_AT_name        : (indirect string, offset: 0x10814a): qwqx
    <fb2>   DW_AT_decl_file   : 2
    <fb3>   DW_AT_decl_line   : 364
    <fb5>   DW_AT_decl_column : 17
    <fb6>   DW_AT_type        : <0xabf>
    <fba>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><fbd>: Abbrev Number: 21 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x10814f): qwqy
    <fc2>   DW_AT_decl_file   : 2
    <fc3>   DW_AT_decl_line   : 365
    <fc5>   DW_AT_decl_column : 17
    <fc6>   DW_AT_type        : <0xabf>
    <fca>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><fcd>: Abbrev Number: 21 (DW_TAG_variable)
    <fce>   DW_AT_name        : (indirect string, offset: 0x108154): qwqz
    <fd2>   DW_AT_decl_file   : 2
    <fd3>   DW_AT_decl_line   : 366
    <fd5>   DW_AT_decl_column : 17
    <fd6>   DW_AT_type        : <0xabf>
    <fda>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><fdd>: Abbrev Number: 21 (DW_TAG_variable)
    <fde>   DW_AT_name        : (indirect string, offset: 0x1087a3): qxqy
    <fe2>   DW_AT_decl_file   : 2
    <fe3>   DW_AT_decl_line   : 367
    <fe5>   DW_AT_decl_column : 17
    <fe6>   DW_AT_type        : <0xabf>
    <fea>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><fed>: Abbrev Number: 21 (DW_TAG_variable)
    <fee>   DW_AT_name        : (indirect string, offset: 0x1082f9): qxqz
    <ff2>   DW_AT_decl_file   : 2
    <ff3>   DW_AT_decl_line   : 368
    <ff5>   DW_AT_decl_column : 17
    <ff6>   DW_AT_type        : <0xabf>
    <ffa>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><ffd>: Abbrev Number: 21 (DW_TAG_variable)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x108502): qyqz
    <1002>   DW_AT_decl_file   : 2
    <1003>   DW_AT_decl_line   : 369
    <1005>   DW_AT_decl_column : 17
    <1006>   DW_AT_type        : <0xabf>
    <100a>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><100d>: Abbrev Number: 21 (DW_TAG_variable)
    <100e>   DW_AT_name        : (indirect string, offset: 0xb668e): accelerometer
    <1012>   DW_AT_decl_file   : 2
    <1013>   DW_AT_decl_line   : 370
    <1015>   DW_AT_decl_column : 18
    <1016>   DW_AT_type        : <0xb34>
    <101a>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><101d>: Abbrev Number: 0
 <1><101e>: Abbrev Number: 24 (DW_TAG_subprogram)
    <101f>   DW_AT_external    : 1
    <101f>   DW_AT_name        : (indirect string, offset: 0x1085df): FusionAhrsGetLinearAcceleration
    <1023>   DW_AT_decl_file   : 2
    <1024>   DW_AT_decl_line   : 328
    <1026>   DW_AT_decl_column : 14
    <1027>   DW_AT_prototyped  : 1
    <1027>   DW_AT_type        : <0xb34>
    <102b>   DW_AT_low_pc      : 0x0
    <102f>   DW_AT_high_pc     : 0x17e
    <1033>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1035>   DW_AT_GNU_all_tail_call_sites: 1
    <1035>   DW_AT_sibling     : <0x105a>
 <2><1039>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <103a>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <103e>   DW_AT_decl_file   : 2
    <103f>   DW_AT_decl_line   : 328
    <1041>   DW_AT_decl_column : 70
    <1042>   DW_AT_type        : <0xf30>
    <1046>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><1049>: Abbrev Number: 21 (DW_TAG_variable)
    <104a>   DW_AT_name        : (indirect string, offset: 0x108221): gravity
    <104e>   DW_AT_decl_file   : 2
    <104f>   DW_AT_decl_line   : 332
    <1051>   DW_AT_decl_column : 24
    <1052>   DW_AT_type        : <0xb40>
    <1056>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><1059>: Abbrev Number: 0
 <1><105a>: Abbrev Number: 23 (DW_TAG_subprogram)
    <105b>   DW_AT_external    : 1
    <105b>   DW_AT_name        : (indirect string, offset: 0xad853): FusionAhrsGetQuaternion
    <105f>   DW_AT_decl_file   : 2
    <1060>   DW_AT_decl_line   : 318
    <1062>   DW_AT_decl_column : 18
    <1063>   DW_AT_prototyped  : 1
    <1063>   DW_AT_type        : <0xbad>
    <1067>   DW_AT_low_pc      : 0x8002ea4
    <106b>   DW_AT_high_pc     : 0x46
    <106f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1071>   DW_AT_GNU_all_call_sites: 1
    <1071>   DW_AT_sibling     : <0x1086>
 <2><1075>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1076>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <107a>   DW_AT_decl_file   : 2
    <107b>   DW_AT_decl_line   : 318
    <107d>   DW_AT_decl_column : 66
    <107e>   DW_AT_type        : <0xf30>
    <1082>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><1085>: Abbrev Number: 0
 <1><1086>: Abbrev Number: 18 (DW_TAG_subprogram)
    <1087>   DW_AT_external    : 1
    <1087>   DW_AT_name        : (indirect string, offset: 0x1086bf): FusionAhrsUpdateExternalHeading
    <108b>   DW_AT_decl_file   : 2
    <108c>   DW_AT_decl_line   : 293
    <108e>   DW_AT_decl_column : 6
    <108f>   DW_AT_prototyped  : 1
    <108f>   DW_AT_low_pc      : 0x0
    <1093>   DW_AT_high_pc     : 0x14a
    <1097>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1099>   DW_AT_GNU_all_tail_call_sites: 1
    <1099>   DW_AT_sibling     : <0x112f>
 <2><109d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <109e>   DW_AT_name        : (indirect string, offset: 0xe5c0b): ahrs
    <10a2>   DW_AT_decl_file   : 2
    <10a3>   DW_AT_decl_line   : 293
    <10a5>   DW_AT_decl_column : 56
    <10a6>   DW_AT_type        : <0xed9>
    <10aa>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><10ad>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x742fd): gyroscope
    <10b2>   DW_AT_decl_file   : 2
    <10b3>   DW_AT_decl_line   : 293
    <10b5>   DW_AT_decl_column : 81
    <10b6>   DW_AT_type        : <0xb40>
    <10ba>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><10bd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10be>   DW_AT_name        : (indirect string, offset: 0xb668e): accelerometer
    <10c2>   DW_AT_decl_file   : 2
    <10c3>   DW_AT_decl_line   : 293
    <10c5>   DW_AT_decl_column : 111
    <10c6>   DW_AT_type        : <0xb40>
    <10ca>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><10cd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x1086b7): heading
    <10d2>   DW_AT_decl_file   : 2
    <10d3>   DW_AT_decl_line   : 293
    <10d5>   DW_AT_decl_column : 138
    <10d6>   DW_AT_type        : <0xabf>
    <10da>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><10dd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10de>   DW_AT_name        : (indirect string, offset: 0xbdada): deltaTime
    <10e2>   DW_AT_decl_file   : 2
    <10e3>   DW_AT_decl_line   : 293
    <10e5>   DW_AT_decl_column : 159
    <10e6>   DW_AT_type        : <0xabf>
    <10ea>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
